[
  {
    "id": 0,
    "info": {
      "abbriviature": "ANT 180",
      "description": "This course presents the four main subfields of Anthropology.  It is aimed at students interested in what it means to be human, and those curious about the Anthropology major. \n",
      "title": "Being Human: An Introduction to Four Field Anthropology"
    }
  },
  {
    "id": 1,
    "info": {
      "abbriviature": "ANT 204",
      "description": "n/a",
      "title": "Capitalism in Crisis"
    }
  },
  {
    "id": 2,
    "info": {
      "abbriviature": "ANT 222/SOC 222",
      "description": "In this seminar, we will explore the historical trajectory of global development as a set of ideas and practices.  Using both anthropological and sociological approaches we will examine the shortcoming and failures of development as we know it today and think about new ways in which the problems of development can be approached and tackled. ",
      "title": "Approaches to Global Development"
    }
  },
  {
    "id": 3,
    "info": {
      "abbriviature": "ANT 233",
      "description": "This course will examine the archaeological record of Eurasia, starting with the earliest archaeological sites outside of Africa around 1.8 million years ago and ending with the period just before we begin to see the first signs of agriculture around 10,000 years ago. ",
      "title": "Cavemen, Mammoths, and Sabertooths: Stone Age Archaeology in Eurasia"
    }
  },
  {
    "id": 4,
    "info": {
      "abbriviature": "ANT 270",
      "description": "n/a",
      "title": "Anthropology of Warfare"
    }
  },
  {
    "id": 5,
    "info": {
      "abbriviature": "ANT 302/REL 301",
      "description": "n/a",
      "title": "Anthropology of Religion and Secularism"
    }
  },
  {
    "id": 6,
    "info": {
      "abbriviature": "ANT 306",
      "description": "n/a",
      "title": "Anthropology of Performance"
    }
  },
  {
    "id": 7,
    "info": {
      "abbriviature": "ANT 331",
      "description": "This seminar surveys the emergence of power and inequality in the ancient world through the lens of archaeology. Both dense urban centers and geographically dispersed ruins will be covered to examine interactions between the ‘powerful’ and ‘powerless’—and how this shaped world civilizations. Comparative case studies will provide material for our in-class discussions where we will deliberate how humans have built complex organizational structures to assert their power, take it from others, and to shape various modes of identity through agency. Anthropological literature that explores and questions traditional notions of civilization and complexity will provide a theoretical framework for broaching these topics intellectually and with a critical mind. ",
      "title": "Archaeology of Power and Inequality"
    }
  },
  {
    "id": 8,
    "info": {
      "abbriviature": "ANT 364",
      "description": "n/a",
      "title": "Building babies: Human evolutionary developmental biology"
    }
  },
  {
    "id": 9,
    "info": {
      "abbriviature": "ANT 382",
      "description": "This course examines contemporary topics in global health. This course focuses on a number of ethnographic case studies that illustrate a breadth of topics relevant to understanding sickness and health.",
      "title": "Anthropology of Global Health: The Global in the Local"
    }
  },
  {
    "id": 10,
    "info": {
      "abbriviature": "ANT 498",
      "description": "ANT 498 is the first part of the year-long capstone seminar taught to senior students majoring in Anthropology. During this course students will design their research projects, develop research instruments, review relevant literature, obtain ethics review approval from the SHSS ethics review committee, and start data collection. There will be two types of capstone projects: Track One: An independent academic research and undergraduate thesis. Track Two: Community-engagement participatory research project and project report.",
      "title": "Capstone Seminar I"
    }
  },
  {
    "id": 11,
    "info": {
      "abbriviature": "ANT 499",
      "description": "ANT 499 is the second part of the year-long capstone seminar taught to senior students majoring in Anthropology. The goal of this course is to help students consolidate your analytical, writing, communication, and presentation skills as well as learn new practical skills that allow students to communicate their work to both academic and nonacademic audiences.  Students will engage in systematically analyzing data, writing their findings, and revising their work through feedback and comments with the guidance of the teaching faculty member, peers, research advisor, and other experts brought into assist in the process of constructing an original product.  ",
      "title": "Capstone Seminar II"
    }
  },
  {
    "id": 12,
    "info": {
      "abbriviature": "ANT 506",
      "description": "In this class, we will examine works by anthropologists, philosophers, linguists, sociologists, and other scholars of performance to attempt  to understand how different ideas about performance can be useful in understanding human social behavior and language.   ",
      "title": "Anthropology of Performance\t"
    }
  },
  {
    "id": 13,
    "info": {
      "abbriviature": "ARB 101",
      "description": "n/a",
      "title": "Beginning Arabic I"
    }
  },
  {
    "id": 14,
    "info": {
      "abbriviature": "ARB 102",
      "description": "The course continues ARB 101. Students will learn the vocabulary and structures necessary for basic oral and written communication in Arabic language. ",
      "title": "Beginning Arabic II"
    }
  },
  {
    "id": 15,
    "info": {
      "abbriviature": "BENG 116",
      "description": "n/a",
      "title": "Applied Mechanics"
    }
  },
  {
    "id": 16,
    "info": {
      "abbriviature": "BENG 118",
      "description": "n/a",
      "title": "Basic Mechanics"
    }
  },
  {
    "id": 17,
    "info": {
      "abbriviature": "BENG 240",
      "description": "n/a",
      "title": "Business Awareness and Entrepreneurships"
    }
  },
  {
    "id": 18,
    "info": {
      "abbriviature": "BIOL 0",
      "description": "n/a",
      "title": "Biology Foundation with Lab"
    }
  },
  {
    "id": 19,
    "info": {
      "abbriviature": "BIOL 101",
      "description": "n/a",
      "title": "Biology for non-Science majors"
    }
  },
  {
    "id": 20,
    "info": {
      "abbriviature": "BIOL 298",
      "description": "Biology Internship - 1A is a 1 credit experiential learning endeavor where students work in a \"real-life\" biological sciences environment",
      "title": "Biology Internship - 1A"
    }
  },
  {
    "id": 21,
    "info": {
      "abbriviature": "BIOL 299",
      "description": "Biology Internship - 1B is a 3 credit experiential learning endeavor where students work in a \"real-life\" biological sciences environment. ",
      "title": "Biology Internship - 1B"
    }
  },
  {
    "id": 22,
    "info": {
      "abbriviature": "BIOL 341",
      "description": "This course aims to describe and explain, in molecular terms, all the chemical processes of the living cell.",
      "title": "Biochemistry I"
    }
  },
  {
    "id": 23,
    "info": {
      "abbriviature": "BIOL 352",
      "description": "n/a",
      "title": "Biology of Cancer"
    }
  },
  {
    "id": 24,
    "info": {
      "abbriviature": "BIOL 385",
      "description": "After completion of the course the participants should have deep understanding of principles behind the cell signaling and know major pathways in control of gene expression and cellular metabolism.",
      "title": "Cell signaling: principles and mechanisms"
    }
  },
  {
    "id": 25,
    "info": {
      "abbriviature": "BIOL 398",
      "description": "Biology Internship - 2A is a 1 credit experiential learning endeavor where students work in a \"real-life\" biological sciences environment.",
      "title": "Biology Internship - 2A"
    }
  },
  {
    "id": 26,
    "info": {
      "abbriviature": "BIOL 399",
      "description": "Biology Internship is a 3 credit experiential learning endeavor where students work in a \"real-life\" biological sciences environment. ",
      "title": "Biology Internship"
    }
  },
  {
    "id": 27,
    "info": {
      "abbriviature": "BIOL 420",
      "description": "This course begins with a brief overview of ethics, values and principles relevant to ethics of biological sciences and biomedicine.",
      "title": "Bioethics"
    }
  },
  {
    "id": 28,
    "info": {
      "abbriviature": "BIOL 425",
      "description": "The Biomedical Research Methods course covers a broad area of the basic and common methods instrumental for biomedical sciences including gene expression to purification of proteins and their complexes. The main purpose is to provide not only the fundamental knowledge how common methods work but also acquire the understanding of key practical steps required for completion of biomedical experiments.",
      "title": "Biomedical Research Methods"
    }
  },
  {
    "id": 29,
    "info": {
      "abbriviature": "BIOL 455",
      "description": "An upper-level undergraduate course that covers the principles and latest techniques in biotechnology. ",
      "title": "Biotechnology"
    }
  },
  {
    "id": 30,
    "info": {
      "abbriviature": "BIOL 456",
      "description": "n/a",
      "title": "Biology Research Design"
    }
  },
  {
    "id": 31,
    "info": {
      "abbriviature": "BIOL 470",
      "description": "An upper-level undergraduate course that covers in depth the latest advances in cell biology.",
      "title": "Advanced Cell Biology"
    }
  },
  {
    "id": 32,
    "info": {
      "abbriviature": "BIOL 530",
      "description": "n/a",
      "title": "Bioethics Principles and Practices"
    }
  },
  {
    "id": 33,
    "info": {
      "abbriviature": "BIOL 570",
      "description": "This course will cover methods and applications of biotechnology, examines present and future developments in this area.",
      "title": "Advanced Biotechnology "
    }
  },
  {
    "id": 34,
    "info": {
      "abbriviature": "BIOL 580",
      "description": "This course designed for biologists combines conceptual and theoretical underpinnings of biological data analyses and information extraction with bioinformatics tools.",
      "title": "Applied Bioinformatics"
    }
  },
  {
    "id": 35,
    "info": {
      "abbriviature": "BIOL 591",
      "description": "This course will address topics in each of the three major divisions of Biophysics: bio-molecular structure, biophysical techniques, and biological mechanisms. The goal of the course is to introduce and critically discuss the central concepts of physical chemistry and their application to gain an in-depth understanding of the fundamental biological principles underlying cellular physiology.",
      "title": "Cellular Biophysics"
    }
  },
  {
    "id": 36,
    "info": {
      "abbriviature": "BIOL 623",
      "description": "This course will provide comprehensive knowledge about how the immune system develops, is regulated, communicates, and how its functional impairment contributes to human diseases.",
      "title": "Advanced Immunology"
    }
  },
  {
    "id": 37,
    "info": {
      "abbriviature": "BIOL 737",
      "description": "Advanced Optical and Electron Microscopy will cover different light microscopic methods: contrast enhancement, fluorescent,  confocal, two-photon and superresolution microscopy and electron microscopic methods – transmission electron microscopy including cryo tomography; scanning electron microscopy; scanning-transmission electron microscopy.",
      "title": "Advanced Optical and Electron Microscopy"
    }
  },
  {
    "id": 38,
    "info": {
      "abbriviature": "BIOL 770",
      "description": "This course will cover methods and applications of biotechnology, examines present and future developments in this area.",
      "title": "Advanced Biotechnology "
    }
  },
  {
    "id": 39,
    "info": {
      "abbriviature": "BIOL 780",
      "description": "This course is designed for PhD students in life sciences. It combines the theoretical underpinnings of biological data analyses and information extraction with scripting and practical use of bioinformatics tools.",
      "title": "Applied Bioinformatics"
    }
  },
  {
    "id": 40,
    "info": {
      "abbriviature": "BIOL 791",
      "description": "This course will address topics in each of the three major divisions of Biophysics: bio-molecular structure, biophysical techniques, and biological mechanisms. The goal of the course is to introduce and critically discuss the central concepts of physical chemistry and their application to gain an in-depth understanding of the fundamental biological principles underlying cellular physiology.",
      "title": "Cellular Biophysics"
    }
  },
  {
    "id": 41,
    "info": {
      "abbriviature": "CEE 204",
      "description": "This module will introduce the concept of civil engineering drawings and will impart the knowledge of surveying.",
      "title": "Civil Engineering CAD and Surveying"
    }
  },
  {
    "id": 42,
    "info": {
      "abbriviature": "CHEM 0",
      "description": "n/a",
      "title": "Chemistry Foundation with Lab"
    }
  },
  {
    "id": 43,
    "info": {
      "abbriviature": "CHEM 001",
      "description": "Student study hour. Each session lasts 75 minutes and students are required to attend twice a week. Faculty will be supervising and available for assistance. ",
      "title": "Chemistry Study Hour"
    }
  },
  {
    "id": 44,
    "info": {
      "abbriviature": "CHEM 090",
      "description": "n/a",
      "title": "Chemistry for Non-Science majors"
    }
  },
  {
    "id": 45,
    "info": {
      "abbriviature": "CHEM 101",
      "description": "n/a",
      "title": "Chemistry I with lab"
    }
  },
  {
    "id": 46,
    "info": {
      "abbriviature": "CHEM 191",
      "description": "Introduction to the fundamental concepts of chemistry such as atomic structure, classification of compounds and chemical bonding to be followed by a rigorous approach to chemical thermodynamics and kinetics. It is expected that students have a working knowledge of differential and integral calculus or equivalent.",
      "title": "Chemistry I for Engineers "
    }
  },
  {
    "id": 47,
    "info": {
      "abbriviature": "CHEM 192",
      "description": "This course is designed to expand upon the basic understanding of Chemistry.",
      "title": "Chemistry II for Engineers"
    }
  },
  {
    "id": 48,
    "info": {
      "abbriviature": "CHEM 311",
      "description": "n/a",
      "title": "Advanced Organic Chemistry I (A)"
    }
  },
  {
    "id": 49,
    "info": {
      "abbriviature": "CHEM 341",
      "description": "An introduction to the chemistry of living things with a focus on the structure and function of proteins, nucleic acids, lipids and carbohydrates, mechanism and kinetics of enzymatic reactions and regulation and vitamins.",
      "title": "Biochemistry I"
    }
  },
  {
    "id": 50,
    "info": {
      "abbriviature": "CHEM 341L",
      "description": "Lab practical that accompanies CHEM 341. Experiments are selected such that they will provide practical application of principles that are covered concurrently with the lecture.",
      "title": "Biochemistry I Lab"
    }
  },
  {
    "id": 51,
    "info": {
      "abbriviature": "CHEM 388",
      "description": "The internship provides an opportunity for a student to gain practical hands-on experience in a related field of interest. ",
      "title": "Chemistry Internship"
    }
  },
  {
    "id": 52,
    "info": {
      "abbriviature": "CHEM 400",
      "description": "This course will provide and introduce the students to the techniques and style of technical oral and poster presentation generally accepted by professional chemist. In addition, students will also develop listening skills, critical analysis of scientific presentations, participation in scientific discussions and introduction of speakers and invited guests. This course will culminate with a conference type seminar, in which student will be doing both an oral and poster presentation of their choosing.",
      "title": "Chemistry Seminar"
    }
  },
  {
    "id": 53,
    "info": {
      "abbriviature": "CHEM 401",
      "description": "This course will cover various pedagogical aspects associated with the teaching of chemistry.",
      "title": "Chemical Education"
    }
  },
  {
    "id": 54,
    "info": {
      "abbriviature": "CHEM 411",
      "description": "This course builds upon the principles taught in CHEM211 and CHEM212.",
      "title": "Advanced Organic Chemistry I"
    }
  },
  {
    "id": 55,
    "info": {
      "abbriviature": "CHEM 412",
      "description": "This course introduces students to a plethora of named reactions, organometallic catalysis and modern reagents for organic synthesis.",
      "title": "Advanced Organic Chemistry II"
    }
  },
  {
    "id": 56,
    "info": {
      "abbriviature": "CHEM 442",
      "description": "This course serves as an introduction to bioenergetics, enzyme regulation and metabolic pathways.",
      "title": "Biochemistry II with Lab-Metabolic Biochemistry"
    }
  },
  {
    "id": 57,
    "info": {
      "abbriviature": "CHEM 450",
      "description": "This course will discuss chemistry of d-, f- and selected p-block elements with in-depth analysis of organometallic reactions and catalysis and inorganic solid state chemistry. Some advanced inorganic topics related to catalysis and materials science will be covered. ",
      "title": "Advanced Inorganic Chemistry"
    }
  },
  {
    "id": 58,
    "info": {
      "abbriviature": "CHEM 450L",
      "description": "This course complements CHEM450, and affords students the opportunity to apply what they have learnt in CHEM450 in a laboratory setting. Students will be required to use multiple experimental techniques, some of which were introduced in CHEM212L, in executing a number of advanced experiments covering transition metal and main group element chemistry, coordination compounds, catalysis and materials chemistry. ",
      "title": "Advanced Inorganic Chemistry Laboratory"
    }
  },
  {
    "id": 59,
    "info": {
      "abbriviature": "CHEM 451",
      "description": "This course focuses on industrial catalytic transformations relevant to petroleum chemistry and synthesis of fine and commodity chemicals. We will discuss application of organometallic and transition metal catalysts, their properties together with advantages and/or disadvantages of such catalysts over trivial heterogeneous systems. In-depth analysis of mechanisms of catalytic reactions, catalyst separation methods and challenges in applying homogeneous systems in industrial setting will be discussed.",
      "title": "Applied Homogenous Catalysis"
    }
  },
  {
    "id": 60,
    "info": {
      "abbriviature": "CHEM 520",
      "description": "This course will be a survey of the major up to date analytical methods including spectroscopic methods such as molecular absorption, atomic absorption and emission, fluorescence spectroscopy, mass spectrometry, methods of electroanalytical chemistry and surface analysis. Various analytical aspects of non-optical spectroscopy and microscopy, including atomic force and electron microscopy as well as gas and liquid chromatography will be covered. An introduction to relevant instrumentation and examples of typical applications of those methods will be discussed.\n\n",
      "title": "Applied Analytical Chemistry "
    }
  },
  {
    "id": 61,
    "info": {
      "abbriviature": "CHME 200",
      "description": "This course is designed to introduce the Chemical Engineering students the basic chemical engineering concepts and methods of system analysis. The topics in this course will include introduction to engineering calculations, process and process variables, fundamentals of material balances, single- and multi-phase systems, and energy balances related to reactive and non-reactive systems. Some case studies of chemical process industries will also be analyzed in more details.  ",
      "title": "Basic Principles and Calculations in Chemical Engineering"
    }
  },
  {
    "id": 62,
    "info": {
      "abbriviature": "CHME 201",
      "description": "The course covers basics of chemical thermodynamics and vapor liquid equilibrium systems.",
      "title": "Chemical Engineering Thermodynamics"
    }
  },
  {
    "id": 63,
    "info": {
      "abbriviature": "CHN 101",
      "description": "n/a",
      "title": "Beginning Mandarin I"
    }
  },
  {
    "id": 64,
    "info": {
      "abbriviature": "CHN 102",
      "description": "This course is the extension of Chin 101 from previous semester. It is for students who have successfully completed Chinese 101 or its equivalent, or students who can understand Chinese minimally and produce simple sentences. ",
      "title": "Beginning Mandarin II"
    }
  },
  {
    "id": 65,
    "info": {
      "abbriviature": "CSCI 270",
      "description": "n/a",
      "title": "Algorithms"
    }
  },
  {
    "id": 66,
    "info": {
      "abbriviature": "CSCI 390",
      "description": "n/a",
      "title": "Artificial Intelligence"
    }
  },
  {
    "id": 67,
    "info": {
      "abbriviature": "CSCI 445",
      "description": "n/a",
      "title": "Bioinformatics"
    }
  },
  {
    "id": 68,
    "info": {
      "abbriviature": "CSCI 490",
      "description": "During this course students will learn about the most important topics of Brain Computer Interfaces (BCI). Students will study basic neuroanatomy, neurophysiology as well as the neural basis of Electroencephalography (EEG). Event-Related Potentials (ERP), multi-variate ERP models as well as linear models of EEG will be introduced. Furthermore, some common data analytical tools will be covered, such as PCA, NCC, LDA/RLDA. Also, ERP as well as SMR-based BCI applications and SSVEP-based BCI will be introduced. At the end of the course, students will carry out a small project.",
      "title": "Brain Computer Interface"
    }
  },
  {
    "id": 69,
    "info": {
      "abbriviature": "CSCI 511",
      "description": "n/a",
      "title": "CS Track Core-Theory"
    }
  },
  {
    "id": 70,
    "info": {
      "abbriviature": "CSCI 545",
      "description": "This course will review essential statistical and machine learning techniques for data processing and examine their scalability.  Students will gain an understanding of current best practices in Big Data processing and complete assignments and projects with a variety of relevant software tools. ",
      "title": "Big Data Analytics"
    }
  },
  {
    "id": 71,
    "info": {
      "abbriviature": "CSCI 547",
      "description": "Financial practices have substantially benefited from the domains of computer science (CS) and artificial intelligence (AI), to the point that most trading in major financial markets are now governed by algorithms. This course aims to provide the CS students with the necessary background and guidance in order to have them practically apply their CS and AI knowledge in financial domains. The course consists of 4 parts: In the first part of the course, all necessary financial background will be provided. In the second part, tangible mechanics of the domain (like the Financial Information Exchange, FIX, protocol, and order book dynamics) will be covered. In the third part, algorithmic side of the financial transactions will be elaborated on. And in the last part, quantitative strategies (like portfolio construction, high-frequency trading, news handling, etc.) which make heavy use of statistics, AI, data mining, time series analysis, and performance evaluations will be covered.",
      "title": "Algorithmic Trading"
    }
  },
  {
    "id": 72,
    "info": {
      "abbriviature": "CSCI 581",
      "description": "Students will learn a number of important topics in the field of computational biomedicine. They will study various topics within the biomedical domain, including primers of anatomy, physiology as well as the basis of various biomedical imaging techniques. Signal processing tools, such as filter theory, artifact rejection, as well as PCA and CSP will be covered. Additionally, we will cover how uni- as well as multi-variate features can be employed for decoding. Practical computing sessions will be carried out and students will also perform a project, where all research-related steps will be covered.",
      "title": "Acquisition and Analysis of Biomedical Data"
    }
  },
  {
    "id": 73,
    "info": {
      "abbriviature": "CSCI 591",
      "description": "This course covers the latest advances in probabilistic, statistical and network-based computational models for real world problems such as computer vision and decision making.",
      "title": "Advanced Artificial Intelligence"
    }
  },
  {
    "id": 74,
    "info": {
      "abbriviature": "CSCI 702",
      "description": "The course introduces the hardware and software aspects of embedded processor architectures, embedded operating systems and intelligent system algorithm implementations to design embedded control systems that are used to drive complex mechatronics systems such as robots, automobiles, avionics, medical equipment, etc. Students will learn how apply these principles on the example of autonomous mobile robot hardware/software design.",
      "title": "Advanced Hardware/Software Co-Design"
    }
  },
  {
    "id": 75,
    "info": {
      "abbriviature": "CSCI 725",
      "description": "In this course, students will be introduced to the most salient concepts in quantum computing, a relatively recent approach that specifically targets computing on the atomic and subatomic levels.  The basics of quantum computing, including quantum states, unitary operators, and measurements will be presented.  Through reversible and quantum circuits, students will learn and understand the advantages and limitations of quantum computing.  Finally, different models of quantum computing will be given as illustrations of potential technological implementations.",
      "title": "Advanced Quantum Computing"
    }
  },
  {
    "id": 76,
    "info": {
      "abbriviature": "CSCI 745",
      "description": "This course will review essential statistical and machine learning techniques for data processing and examine their scalability.  Students will gain an understanding of current best practices in Big Data processing and complete assignments and projects with a variety of relevant software tools. ",
      "title": "Advanced Big Data Analytics"
    }
  },
  {
    "id": 77,
    "info": {
      "abbriviature": "CSCI 747",
      "description": "This course aims to provide the students with a strong theoretical background and a large set of practical computational skills that are necessary for building up a competitive edge in utilizing modern trading strategies and technologies to capitalize on today’s sophisticated financial markets and trading instruments. The lectures will provide a holistic coverage of financial market structure and dynamics, electronic trading infrastructure, software tools, and algorithmic trading strategies along with all necessary complementary terminology and information such as the common practices of both global and local markets. The course distinctively unites the domains of finance, econo-metrics and particularly computer science. Industry standards such as the Financial Information Exchange (FIX) protocol, limit-order book dynamics, algorithmic side of financial transactions, quantitative strategies, portfolio construction and management, news handling, and high-frequency trading methods will be covered along with practical examples that make heavy use of data mining, machine learning and time-series analysis techniques.",
      "title": "Advanced Algorithmic Trading"
    }
  },
  {
    "id": 78,
    "info": {
      "abbriviature": "CSCI 781",
      "description": "Students will learn a number of important topics in the field of computational biomedicine, namely the acquisition and analysis of biomedical data. Students will study various topics within the biomedical domain, including primers of anatomy, physiology as well as the basis of various biomedical imaging techniques, such as electroencephalography (EEG), near-infrared spectroscopy (NIRS), functional Magnetic Resonance Imaging (fMRI), electrocardiogram (ECG), electromyogram (EMG), among others. Signal processing tools, such as filter theory, artifact rejection, as well as PCA, CSP and ICA will be covered. Additionally, we will cover how uni- as well as multi-variate features can be employed for decoding. In addition, we will cover a number of machine learning tools commonly used in the biomedical and neuroscientific community, such as RLDA, SVM, CNN, among others. Practical computing sessions will be carried out, such that the presented knowledge can be put into practice. Finally, students will also carry out a hands-on project, where all research-related steps will be covered, such as creating a hypothesis, experimental design with python, data acquisition and finally acquired data will be disseminated, interpreted and presented.",
      "title": "Advanced Acquisition and Analysis of Biomedical Data"
    }
  },
  {
    "id": 79,
    "info": {
      "abbriviature": "CSCI 791",
      "description": "This course covers the latest advances in probabilistic, statistical and network-based computational models for real world problems such as computer vision and decision making.  Topical coverage will begin at hidden Markov Models, through Markov networks, up to conditional random fields.  Additionally, we will cover novel advances in artificial intelligence such as causal reasoning, learning from data to reason, building models by learning from data and model optimization.",
      "title": "Advanced Artificial Reasoning and Problem solving "
    }
  },
  {
    "id": 80,
    "info": {
      "abbriviature": "CSCI 794",
      "description": "This course is a one-semester course intended for graduate students in Computer Science PhD program. It introduces the students to the concepts and existing models and techniques of deep learning. The main themes of the course are benefits, properties and challenges of deep learning; introduction to machine learning and optimization; challenges and common approaches; regularization; convolutional neural networks; deep recurrent networks and sequence learning; generative adversarial networks; autoencoders; advanced deep learning topics; applications. The students will learn how to design a deep learning architecture. The course presents several common deep learning techniques and exposes the students in learning how to use deep learning in a very efficient manner. Students will gain experience through assignments and projects, with an emphasis on proper deep learning practices with appropriate applications.\n\n",
      "title": "Advanced Deep Learning"
    }
  },
  {
    "id": 81,
    "info": {
      "abbriviature": "DCEE 757",
      "description": "This course will provide MSc students of Civil and Environmental Engineering advanced knowledge of environmental chemistry to estimate and evaluate the fate of potential chemical species in engineered and natural environmental systems.",
      "title": "Advanced Environmental Chemistry"
    }
  },
  {
    "id": 82,
    "info": {
      "abbriviature": "DCEE 766",
      "description": "This course is designed to develop student’s knowledge further and enable them to plan, design, and analyze new and existing pavements.  This course addresses the theory and practice in the fundamentals of pavement design and rehabilitation strategy such as pavement performance, structural design of pavement layers, types of materials used in pavement layers, characterization of pavement layer materials.  Concepts of pavement management and pavement rehabilitation strategy will be introduced.  Pavement design and evaluation computational tools will be introduced and applied.",
      "title": "Advanced Pavement Design, Analysis, and Rehabilitation"
    }
  },
  {
    "id": 83,
    "info": {
      "abbriviature": "DCEE 767",
      "description": "The objective of this course is to prepare students for advanced-level structural engineering employment by providing them with abilities to design and analyze reinforced concrete structures. This course provides students with advanced techniques, such as section analysis, yield line theory, 2nd order analysis, and Bresler’s reciprocal theory, for analysis and design of reinforced concrete structural members under the complicate loading conditions such as torsion, bi-axial bending, and buckling.",
      "title": "Advanced Concrete Design"
    }
  },
  {
    "id": 84,
    "info": {
      "abbriviature": "DCEE 768",
      "description": "This course will provide graduate students detailed theoretical background and its applications to the design and development of advanced wastewater treatment systems.",
      "title": "Advanced Wastewater Treatment"
    }
  },
  {
    "id": 85,
    "info": {
      "abbriviature": "DCHME 715",
      "description": "This course discusses chemical and thermodynamic processes in the atmosphere resulting in the nucleation of the airborne particles. The resulting health effects on the human will be discussed. This course explains how to identify sources of pollutants indoors and outdoor, their exposure routes, emission rate of the pollutants, and approaches to reduce the emissions",
      "title": "Air Quality, Toxicity and Health"
    }
  },
  {
    "id": 86,
    "info": {
      "abbriviature": "DCHME 761",
      "description": "The course is addressed to PhD students and aims at reinforcing and enhancing the knowledge they have on chemical reaction engineering. The principles presented will be connected with relevant applications, especially in the production of innovative materials. Specifically, advanced topics will be covered, like chemical vapor deposition reactors and applications, providing students with a broader appreciation of the applications of reaction engineering principles and methods in materials production.",
      "title": "Advanced Chemical Reaction Engineering"
    }
  },
  {
    "id": 87,
    "info": {
      "abbriviature": "DCHME 762",
      "description": "The main technologies for the production of high-value materials from polymers and ceramics, and daily used consumer care products, as well and the theory which underlies materials processing operations will be covered in this course.",
      "title": "Advanced Materials Processing"
    }
  },
  {
    "id": 88,
    "info": {
      "abbriviature": "DCHME 766",
      "description": "This course covers the fundamentals, characterizations and preparation methods of advanced and currently used materials for energy applications. Generation, conversion and storage in solar cells, fuel cells and particularly Li-ion batteries are going to be presented. Additionally, special and unique properties of materials will be considered for designing of batteries for particular applications. Other advanced energy related technologies as fuel cell and photovoltaics will be introduced and the main applied  materials will be discussed. ",
      "title": "Advanced Energy Materials and Their Application "
    }
  },
  {
    "id": 89,
    "info": {
      "abbriviature": "DELCE 750",
      "description": "The aim of the course is to improve students’ understanding and enhance their knowledge on an advanced bio-medical imaging devices and technologies. During the semester, student will enhance and develop deep knowledge on understanding the cutting-edge principles in bio-medical imaging devices and technologies. Also course aimed to cover the emerging fields of tissue engineering, focusing on the current literature, variety of specialized topics including X-Ray tomography, Magnetic Resonance tomography, Positron Emission Tomography, Electro-cardiography, Electro-encephalography and Optical Coherence Tomography, Ultrasound technology and other clinical technologies/devices.",
      "title": "Advanced Biomedical Imaging Devices and Technologies"
    }
  },
  {
    "id": 90,
    "info": {
      "abbriviature": "DELCE 755",
      "description": "This course presents advanced analytical techniques for formulating and solving problems in applied electromagnetics.  Topics covered are basic electromagnetic theorems, boundary conditions, solutions to the wave equation, Green's functions, spectral domain representations, electric and magnetic field integral equations, and antennas and apertures.  Applications of these methods are also presented in the areas of radiation, radiowave propagation in stratified media, scattering, electromagnetic compatibility, and metamaterials. ",
      "title": "Advanced Electromagnetics"
    }
  },
  {
    "id": 91,
    "info": {
      "abbriviature": "DELCE 758",
      "description": "Industrial and commercial power systems are discussed in this course. Demand and load calculation along with power quality assessment in industrial power network as well as commercial power system network, regulations, demand and over load calculation, and its earthing system are discussed in this course.",
      "title": "Advanced Industrial and Commercial Energy Systems"
    }
  },
  {
    "id": 92,
    "info": {
      "abbriviature": "DELCE 759",
      "description": "Pattern recognition and machine learning provide the technical basis of data mining. Data mining per se is the extraction of implicit unknown and potentially useful information from data. The aim of this module is to introduce fundamental concepts used in design and implementation of pattern recognition and machine learning techniques.",
      "title": "Advanced Pattern Recognition and Machine Learning"
    }
  },
  {
    "id": 93,
    "info": {
      "abbriviature": "DELCE 760",
      "description": "This course introduces students to recently developed and advanced techniques for solving modeling and control problems. The course presents theory and methodology for analysis and modeling of systems and signals, and methods for design and synthesis of advanced feedback controllers. The emphasis of this course will be on mathematical foundations and numerical methods for system modeling from physical properties, identification, and advanced control of dynamical systems. ",
      "title": "Advanced System Modelling and Control"
    }
  },
  {
    "id": 94,
    "info": {
      "abbriviature": "DMAE 701",
      "description": "This course reviews and deepens the advanced analytical and numerical methods to solve ODEs and PDEs. The whole course, lectures, and tutorials will be delivered through a mathematical software package capable to perform symbolical calculations.\nThe module is designed for graduate students to cover their research needs concerning mathematical modeling via analytical, semi-analytical or numerical techniques.\n",
      "title": "Advanced Applied Mathematics"
    }
  },
  {
    "id": 95,
    "info": {
      "abbriviature": "DMAE 765",
      "description": "This PhD-level graduate course aims to provide deep understanding of advanced manufacturing terminology and introduces principles, techniques and applications of abrasive and non-conventional machining processes as well as additive manufacturing. Course topic also includes philosophies, and practices developed by world-class manufacturers to meet current manufacturing challenges, such as lean production. Students are expected to carry out an independent study by project and term paper on the related topics.",
      "title": "Advanced Manufacturing Processes and Strategies"
    }
  },
  {
    "id": 96,
    "info": {
      "abbriviature": "DPP 614",
      "description": "The content of this module includes: the identification of, access to and analysis of, social science quantitative data bases relevant to public policy issues. Statistical techniques to explore relationships among variables (correlation; partial correlation; multiple regression; logistic regression; factor analysis; structural equation modelling). Statistical techniques to compare groups (non-parametric statistics; t-tests; multi-analysis of variance). Use of the above techniques to interrogate existing social science data bases. Critical review of quantitative research used as the basis of evidence in public policy.\n\n",
      "title": "Advanced Quantitative Methods"
    }
  },
  {
    "id": 97,
    "info": {
      "abbriviature": "DPP 616",
      "description": "The Content of this module include the following: Identification of, access to and analysis of, social science qualitative databases relevant to public policy issues.\nMain research methods associated with qualitative research: ethnography / participant observation; qualitative interviewing; focus groups; language based approaches to the collection of qualitative data, such as discourse and conversation analysis; the collection and qualitative analysis of texts and documents.\nSampling, reliability and validity in qualitative research.\nContrast between qualitative and quantitative research.\nCritical review of qualitative research used as basis of evidence in public policy.\n\n",
      "title": "Advanced Qualitative Methods"
    }
  },
  {
    "id": 98,
    "info": {
      "abbriviature": "DPP 670",
      "description": "This course presents and discusses behavioral regularities that are of potential importance for public policy.",
      "title": "Behavioral Economics and Public Policy"
    }
  },
  {
    "id": 99,
    "info": {
      "abbriviature": "DS 704",
      "description": "Today’s modern and digital world houses vast sources of data which are increasing exponentially as we shift to industry 4.0 practices and plan to have almost every electronic device connected by the use of Internet of Things (IoT) technologies. Analyzing data to identify patterns of interest and to make future projections is a very important feedback for improving processes and procedures. This course teaches modern data mining solutions and illustrates how they are used in decision support systems which are becoming increasingly ubiquitous in all business and industrial sectors. The topics to be covered include knowledge representation, input preparation (preprocessing), fundamental data mining techniques (like probabilistic modeling, linear modeling, association mining, etc.), minimum description length (MDL) principle, validation techniques, decision trees, association rules, instance-based learning models, data transformations, data projections, Bayesian methods, ensemble learning techniques (bagging, boosting, stacking, etc.), visualization, and warehousing within the supervised, unsupervised and semi-supervised learning frameworks.",
      "title": "Advanced Data Mining and Decision Support"
    }
  },
  {
    "id": 100,
    "info": {
      "abbriviature": "EBIO 701",
      "description": "Principles & practice of power systems: steady state analysis of AC & DC motors, electrical motor selection; motor performance & prediction; electro-hydraulic systems; pneumatic systems; simulation & modelling; mechanical power transmission; physics of sensing & sensor design; sensor specification & dynamics; experimental error analysis; measurement uncertainty",
      "title": "Advance Sensors and Actuators"
    }
  },
  {
    "id": 101,
    "info": {
      "abbriviature": "EBIO 710",
      "description": "This course is an introduction to statistical data analysis. Topics are chosen from applied probability, sampling, estimation, hypothesis testing, linear regression, analysis of variance, categorical data analysis, and nonparametric statistics.",
      "title": "Artificial Intelligence in Medicine"
    }
  },
  {
    "id": 102,
    "info": {
      "abbriviature": "EBIO 711",
      "description": "n/a",
      "title": "Biology, Physiology and Human Anatomy for Engineers"
    }
  },
  {
    "id": 103,
    "info": {
      "abbriviature": "EBIO 712",
      "description": "An introduction to the chemistry and physics of soft material systems (polymers, colloids, organized surfactant systems and others), emphasizing the connection between microscopic structure and macroscopic physical properties.",
      "title": "Biomaterials"
    }
  },
  {
    "id": 104,
    "info": {
      "abbriviature": "EBIO 714",
      "description": "Review of biosensors in use and under development and their application in vivo and in vitro monitoring of humans. ",
      "title": "Biosensors"
    }
  },
  {
    "id": 105,
    "info": {
      "abbriviature": "EBIO 782",
      "description": "This course presents the fundamentals of digital signal processing with particular emphasis on problems in biomedical research and clinical medicine. ",
      "title": "Biomedical Signal Processing"
    }
  },
  {
    "id": 106,
    "info": {
      "abbriviature": "ECE 216",
      "description": "This module introduces students to civil engineering theories, tools, and design process for infrastructure projects such as highways, bridges, dams and land development. Design projects include feasibility study, engineering evaluation of site, and layout design of lots, buildings, streets, sewers, etc. The concepts of the site-investigation and urban infrastructures issues will be introduced. The module includes design cases of civil infrastructure projects with an emphasis on technical solutions as well as project impact on the environmental, social and economic factors.",
      "title": "Civil Engineering CAD"
    }
  },
  {
    "id": 107,
    "info": {
      "abbriviature": "ECE 271",
      "description": "This module introduces students to civil engineering theories, tools, and design process for infrastructure projects such as highways, bridges, dams and land development. ",
      "title": "Civil Engineering Design"
    }
  },
  {
    "id": 108,
    "info": {
      "abbriviature": "ECE 302",
      "description": "n/a",
      "title": "Civil Engineering Materials"
    }
  },
  {
    "id": 109,
    "info": {
      "abbriviature": "ECE 401",
      "description": "n/a",
      "title": "Capstone Project 1"
    }
  },
  {
    "id": 110,
    "info": {
      "abbriviature": "ECE 421",
      "description": "This module covers a wide range of critical topics in structural analysis and design including structural load resisting system; structural stiffness, stability and integrity; nonlinearity and plastic collapse mechanism; introduction to finite element methods and innovative structural systems.",
      "title": "Behaviour and Design of Structural System"
    }
  },
  {
    "id": 111,
    "info": {
      "abbriviature": "ECE 474",
      "description": "By completing this module, students will gain understanding of static and kinematic indeterminacy, structural flexibility and stiffness, matrix structural analysis, etc. ",
      "title": "Advanced Structural Engineering"
    }
  },
  {
    "id": 112,
    "info": {
      "abbriviature": "ECE 478",
      "description": "School of Engineering Capstone project is designed to be reflection of a culminating set of personal, academic, and professional experiences.",
      "title": "Capstone Project II"
    }
  },
  {
    "id": 113,
    "info": {
      "abbriviature": "ECHE 220",
      "description": "n/a",
      "title": "Chemical Reaction Engineering and Thermodynamics"
    }
  },
  {
    "id": 114,
    "info": {
      "abbriviature": "ECHE 222",
      "description": "n/a",
      "title": "Chemistry I"
    }
  },
  {
    "id": 115,
    "info": {
      "abbriviature": "ECHE 319",
      "description": "n/a",
      "title": "Chemical Engineering Thermodynamics"
    }
  },
  {
    "id": 116,
    "info": {
      "abbriviature": "ECHE 321",
      "description": "n/a",
      "title": "Chemistry II"
    }
  },
  {
    "id": 117,
    "info": {
      "abbriviature": "ECHE 386",
      "description": "This course addresses the conceptual and detailed design of chemical processes together with plant wide optimization and energy integration (pinch technology).",
      "title": "Chemical Plant Design and Optimization"
    }
  },
  {
    "id": 118,
    "info": {
      "abbriviature": "ECHE 387",
      "description": "This course presents the main concepts and principles regarding the design of non-ideal reactors and covers the fundamentals of heterogeneous reacting systems. Emphasis is given on algorithm development and problem solving.",
      "title": "Chemical Reaction Engineering 2"
    }
  },
  {
    "id": 119,
    "info": {
      "abbriviature": "ECHE 418",
      "description": "n/a",
      "title": "Capstone project 1"
    }
  },
  {
    "id": 120,
    "info": {
      "abbriviature": "ECHE 419",
      "description": "The main objective of this course is to introduce advanced tools to chemical engineering students to perform rigorous plant simulation and detailed optimization. ",
      "title": "Advanced Process Simulation"
    }
  },
  {
    "id": 121,
    "info": {
      "abbriviature": "ECHE 479",
      "description": "This course is designed for chemical engineers to be a reflection of their personal, academic, and professional experiences.",
      "title": "Capstone Project II"
    }
  },
  {
    "id": 122,
    "info": {
      "abbriviature": "ECHE 481",
      "description": "This module covers the topics of Mole balances, Conversion and reactor sizing, Rate laws and stoichiometry, Isothermal reactor design, Collection and analysis of rate data, Multiple reactions, and non-isothermal reactor design.",
      "title": "Chemical Reaction Engineering"
    }
  },
  {
    "id": 123,
    "info": {
      "abbriviature": "ECHE 483",
      "description": "This is an intensive course matching the content for Chemistry II for Engineers in order to be delivered during the summer term.",
      "title": "Chemistry II"
    }
  },
  {
    "id": 124,
    "info": {
      "abbriviature": "ECHE 486",
      "description": "To give Chemical Engineering students a working understanding of the safety and risk assessment and modeling and how to incorporate them in the design of chemical process systems.",
      "title": "Chemical Process Safety "
    }
  },
  {
    "id": 125,
    "info": {
      "abbriviature": "ECHE 488",
      "description": "This course introduces the application of engineering principles including thermodynamics, transport phenomena and reaction engineering in the atmosphere. The course is designed to facilitate student’s learning and help them to better investigate functioning of the atmospheric system.  ",
      "title": "Atmospheric Chemistry and Physics"
    }
  },
  {
    "id": 126,
    "info": {
      "abbriviature": "ECON 305",
      "description": "The course introduces students to major models in informational economics.",
      "title": "Advanced Microeconomics"
    }
  },
  {
    "id": 127,
    "info": {
      "abbriviature": "ECON 306",
      "description": "n/a",
      "title": "Advanced Macroeconomics"
    }
  },
  {
    "id": 128,
    "info": {
      "abbriviature": "ECON 405",
      "description": "The aim of this course is to introduce students to the field of behavioural and experimental economics. The ",
      "title": "Behavioral and Experimental Economics"
    }
  },
  {
    "id": 129,
    "info": {
      "abbriviature": "ECON 498",
      "description": "The course will cover rotating topics of current interest in economics consistent with the level of other advanced elective courses offered within the department.",
      "title": "Advanced Special Topics in Economics"
    }
  },
  {
    "id": 130,
    "info": {
      "abbriviature": "ECON 505",
      "description": "The course introduces students to major models in behavioural economics and major experiments in experimental economics. ",
      "title": "Behavioral and Experimental Economics"
    }
  },
  {
    "id": 131,
    "info": {
      "abbriviature": "ECON 532",
      "description": "\nARMA models, VAR models, Stationary and non-stationary processes, Generalized Method of Moments.\n",
      "title": "Applied Econometrics"
    }
  },
  {
    "id": 132,
    "info": {
      "abbriviature": "EDHE 610",
      "description": "EDHE 610 focuses on the practical application of educational leadership efforts in Kazakhstani educational institutions, with emphasis on planning and change management.",
      "title": "Applying Educational Leadership in Kazakhstan"
    }
  },
  {
    "id": 133,
    "info": {
      "abbriviature": "EDIE 610",
      "description": "EDIE 610 focuses on the practical application of educational leadership efforts in Kazakhstani educational institutions, with emphasis on planning and change management.",
      "title": "Applying Educational Leadership in Kazakhstan"
    }
  },
  {
    "id": 134,
    "info": {
      "abbriviature": "EDML 627",
      "description": "This course focuses on the application of Content and Language Integrated Learning  in teaching",
      "title": "Application of CLIL in Teaching"
    }
  },
  {
    "id": 135,
    "info": {
      "abbriviature": "EDSE 610",
      "description": "EDSE 610 focuses on the practical application of educational leadership efforts in Kazakhstani educational institutions, with emphasis on planning and change management.",
      "title": "Applying Educational Leadership in Kazakhstan"
    }
  },
  {
    "id": 136,
    "info": {
      "abbriviature": "EDUC 505",
      "description": "Academic English I provides students with a structured opportunity to improve oral and written English in professional and academic settings.",
      "title": "Academic English 1"
    }
  },
  {
    "id": 137,
    "info": {
      "abbriviature": "EDUC 506",
      "description": "Academic English 2 provides students with a structured opportunity to improve oral and written English in professional and academic settings.",
      "title": "Academic English II"
    }
  },
  {
    "id": 138,
    "info": {
      "abbriviature": "EDUC 507",
      "description": "Academic English 2 provides students with a structured opportunity to improve oral and written English in professional and academic settings.",
      "title": "Academic English III"
    }
  },
  {
    "id": 139,
    "info": {
      "abbriviature": "EDUC 508",
      "description": "Academic English IV provides students with a structured opportunity to improve oral and written English in professional and academic settings.",
      "title": "Academic English IV"
    }
  },
  {
    "id": 140,
    "info": {
      "abbriviature": "EDUC 510",
      "description": "The course provides in depth knowledge of English Language which will be used by professionals in educational sphere.",
      "title": "Advanced English for Education Professionals I"
    }
  },
  {
    "id": 141,
    "info": {
      "abbriviature": "EDUC 511",
      "description": "EDUC 511 is a course that provides resources and opportunities to develop as competent and confident multilingual scholars and researchers.",
      "title": "Advanced English for Education Professionals II"
    }
  },
  {
    "id": 142,
    "info": {
      "abbriviature": "EDUC 571",
      "description": "EDU571 provides students with a structured opportunity to improve oral and written Kazakh. For beginning/elementary learners. This will be taught as a Distance course utilizing one or more electronic learning environments",
      "title": "Basic Kazakh"
    }
  },
  {
    "id": 143,
    "info": {
      "abbriviature": "EDUC 573",
      "description": "EDU572 provides students with a structured opportunity to improve written Kazakh appropriate for students at the highest level of proficiency working in academic settings. This will be taught as a Distance course utilizing one or more electronic learning environments",
      "title": "Academic Writing in Kazakh"
    }
  },
  {
    "id": 144,
    "info": {
      "abbriviature": "EDUC 590",
      "description": "This course helps PhD students to develop the academic writing skills they need to complete doctoral work. ",
      "title": "Academic English Writing for Doctoral Students I"
    }
  },
  {
    "id": 145,
    "info": {
      "abbriviature": "EDUC 591",
      "description": "EDUC 591 supports the students in preparing for the PhD proposal defense and the eventual writing of the doctoral dissertation.",
      "title": "Academic English Writing for Doctoral Students II"
    }
  },
  {
    "id": 146,
    "info": {
      "abbriviature": "EDUC 702",
      "description": "This course provides a detailed introduction to research methods used in education and in the social sciences.",
      "title": "Advanced Methods of Educational Research II"
    }
  },
  {
    "id": 147,
    "info": {
      "abbriviature": "EDUC 704",
      "description": "The course provides information needed to understand quantitative methods process from idea formulation to data analysis and interpretation.",
      "title": "Advanced Methods of Education Research"
    }
  },
  {
    "id": 148,
    "info": {
      "abbriviature": "EDUC 705",
      "description": "Advanced Methods of Education Research: Qualitative Methods course will examine several common qualitative research methods from both a theoretical and applied perspective.",
      "title": "Advanced Methods of Education Research: Qualitative Methods"
    }
  },
  {
    "id": 149,
    "info": {
      "abbriviature": "EEE 336",
      "description": "Applications of analog electronics; PN-junction theory and major semiconductor devices - diode, bipolar and field - effect transistors, SCR (thyristor);",
      "title": "Analog Electronics"
    }
  },
  {
    "id": 150,
    "info": {
      "abbriviature": "EEE 382",
      "description": "This advanced elective course provides deeper insights into the antenna theory, and understanding. This is targeted at student specializing in communications engineering. ",
      "title": "Antennas and Propagation"
    }
  },
  {
    "id": 151,
    "info": {
      "abbriviature": "EEE 437",
      "description": "n/a",
      "title": "Capstone Project 1"
    }
  },
  {
    "id": 152,
    "info": {
      "abbriviature": "EEE 453",
      "description": "This course provides knowledge on alternative sources of energy and all the matters related to the development and usage of this type of energy.   ",
      "title": "Alternative Energy"
    }
  },
  {
    "id": 153,
    "info": {
      "abbriviature": "EEE 480",
      "description": "Electrical and Electronics Engineering Capstone project is designed to be reflection of a culminating set of personal, academic, and professional experiences.",
      "title": "Capstone Project II"
    }
  },
  {
    "id": 154,
    "info": {
      "abbriviature": "EEE 489",
      "description": "This course focuses on the schematic and physical design of analog integrated circuits. The specific focus is on the circuits such as current mirrors, amplifiers, operational amplifiers, PLLs and mixers.  ",
      "title": "Analog Circuit Design "
    }
  },
  {
    "id": 155,
    "info": {
      "abbriviature": "EENE 716",
      "description": "N/A",
      "title": "CO2 sequestration  "
    }
  },
  {
    "id": 156,
    "info": {
      "abbriviature": "EENE 754",
      "description": "The world’s electricity systems face a number of challenges, including ageing infrastructure, continued growth in demand, the integration of increasing numbers of variable renewable energy sources and electric vehicles, the need to improve the security of supply and the need to lower carbon emissions. Smart grid technologies offer ways not just to meet these challenges but also to develop a cleaner energy supply that is more energy efficient, more affordable and more sustainable. These challenges must also be addressed with regard to each region’s unique technical, financial and commercial regulatory environment. Given the highly regulated nature of the electricity system, proponents of smart grids must ensure that they engage with all stakeholders, including equipment manufacturers, system operators, consumer advocates and consumers, to develop tailored technical, financial and regulatory solutions that enable the potential of smart grids.\n\nMaking a city “smart” is emerging as a strategy to mitigate the problems generated by the urban population growth and rapid urbanization. More than half of the world’s population now lives in urban areas. This shift from a primarily rural to a primarily urban population is projected to continue. Cities, megacities, generate new kinds of problems. Difficulty in waste management, scarcity of resources, air pollution, human health concerns, traffic congestions, and inadequate, deteriorating and aging infrastructures are among the more basic technical, physical, and material problems. The urgency around these challenges is triggering many cities around the world to find smarter ways to manage them. These cities are increasingly described with the label ‘smart city’ which basically is a city that monitors and integrates conditions of all of its critical infrastructures, including roads, bridges, tunnels, rails, subways, airports, seaports, communications, water, power, even major buildings, to better optimize its resources, plan its preventive maintenance activities, and monitor all security aspects while maximizing services to its citizens.\n",
      "title": "Advanced Smart Grids & Future Energy Cities"
    }
  },
  {
    "id": 157,
    "info": {
      "abbriviature": "EICT 702",
      "description": "n/a",
      "title": "Advanced Communications"
    }
  },
  {
    "id": 158,
    "info": {
      "abbriviature": "EICT 753",
      "description": "Antennas, propagation, and electromagnetic modelling",
      "title": "Antennas & Propagation"
    }
  },
  {
    "id": 159,
    "info": {
      "abbriviature": "ELC 100",
      "description": "Course required by all 4th year students, who do not show proof of current IELTS requirement overall 6.5 (with no sections less than 6.0). ",
      "title": "4th year English  "
    }
  },
  {
    "id": 160,
    "info": {
      "abbriviature": "ELCE 201",
      "description": "The objective of this course is to build on the tools and techniques learnt in “ELCE 200 Introduction to Electrical Circuits”. A tentative list of topics includes: Review of Basic Circuit Analysis, Operational Amplifiers-based circuit analysis, Second-Order Circuits and Three-Phase Circuits, Frequency Response of Active Filters, Application of Laplace Transform for Circuit Analysis, Circuit Application using Fourier Analysis, Two-port Networks\n\n",
      "title": "Circuit Theory"
    }
  },
  {
    "id": 161,
    "info": {
      "abbriviature": "EME 354",
      "description": "n/a",
      "title": "Advanced Control Systems"
    }
  },
  {
    "id": 162,
    "info": {
      "abbriviature": "EME 410",
      "description": "This course aims to introduce the concepts, principles, techniques and theory for the analysis of air flow over moving objects including a review of the historical development of aerodynamics and aerospace engineering. The application of aerodynamics to the design of engineering components and systems is emphasized.  ",
      "title": "Aerodynamics"
    }
  },
  {
    "id": 163,
    "info": {
      "abbriviature": "EME 411",
      "description": "This course is divided into two parts: 1) Air Conditioning and 2) Fire Engineering.\n1) The Air Conditioning course aims to relate the scientific theory and principles which govern building air conditioning and, to select and design of the engineering systems to meet requirements.\n2) The second half of the course aims to provide a general understanding of the principles of enclosure fire dynamics, its applications to building fires and smoke analysis as well as the basic design methods for fire-fighting systems. ",
      "title": "Air Conditioning and Fire Engineering"
    }
  },
  {
    "id": 164,
    "info": {
      "abbriviature": "EME 451",
      "description": "n/a",
      "title": "Capstone project 1"
    }
  },
  {
    "id": 165,
    "info": {
      "abbriviature": "EME 477",
      "description": "The objective of the module (it is first part of a yearlong final year project) is to give the student opportunity to create masterpiece using the knowledge obtained during their study in the university",
      "title": "Capstone Project II"
    }
  },
  {
    "id": 166,
    "info": {
      "abbriviature": "EME 485",
      "description": "This module covers applied statistical methods and probability for undergraduate students\t",
      "title": "Applied Statistics and Probability"
    }
  },
  {
    "id": 167,
    "info": {
      "abbriviature": "EME 489",
      "description": "Introduction to Partial Differential Equations and Complex Analysis with the help of special computer software.",
      "title": "Advanced Engineering Mathematics"
    }
  },
  {
    "id": 168,
    "info": {
      "abbriviature": "EMEM 511",
      "description": "This course deals with the work and understanding of strategic management. The course adopts the perspective of managers within the corporation, business, division, plant, or other operating unit who must align their individual actions and responsibilities with the overall objectives of the firm. ",
      "title": "Business Strategy"
    }
  },
  {
    "id": 169,
    "info": {
      "abbriviature": "EMEM 524",
      "description": "This course covers advanced data-mining methods now possible in business and research; Introduction to software for data-visualization and pattern recognition in Big Data and Information Architecture of the Big Data Cloud.",
      "title": "Big Data"
    }
  },
  {
    "id": 170,
    "info": {
      "abbriviature": "EMEM 529",
      "description": "The Capstone project is designed to be reflection of a culminating set of personal, academic, and professional experiences. Students work in teams to apply synthesize knowledge and skills acquired during the course of their education to solve design, construction and operational problems with real world constraints and relevant to industry.",
      "title": "Capstone Project"
    }
  },
  {
    "id": 171,
    "info": {
      "abbriviature": "EMEM 539",
      "description": "This course includes two modules: The Big Data module and the Information Management module. By the end of the course students will be expected, among others, to be able to:\n1.\tapply a set of cross-functional techniques: (i) Computer Science: Databases and their technologies  and Information Management, (ii) Statistical and (iii) Management Science/Operations Research optimization.\n2.\ttake decisions by handling big data in various companies such as: Banking, Insurance, Logistics/SCM, large supermarkets, and other industrial, computer and service firms. \n3.\tgain the knowledge, skills, and abilities to manage information technology systems effectively.   \n4.\tformulate and execute IT policies, strategies, plans and procedures.\n\n",
      "title": "Big Data and Information Management  "
    }
  },
  {
    "id": 172,
    "info": {
      "abbriviature": "EMEM 545",
      "description": "This course establishes a foundation of competent communication in the business world, and provides an opportunity to assess and improve students’ verbal and written communication to be more effective, clear, appropriately assertive and based in foundations of personal integrity and leadership.",
      "title": "Business Communication"
    }
  },
  {
    "id": 173,
    "info": {
      "abbriviature": "EMSE 704",
      "description": "This course will provide training in the engineering principles underlying the design and control of processes for the recovery and purification of materials.",
      "title": "Advanced Materials Processing"
    }
  },
  {
    "id": 174,
    "info": {
      "abbriviature": "EMSE 705",
      "description": "n/a",
      "title": "Advanced Materials Synthesis"
    }
  },
  {
    "id": 175,
    "info": {
      "abbriviature": "EMSE 706",
      "description": "This course sets the foundation of materials, detailing the necessary principles governing the structure, composition and properties of materials. The aim is to give students an understanding of the fundamental principles of modern solid state chemistry structures, properties, syntheses and applications of solid materials. ",
      "title": "Advanced Materials Structure"
    }
  },
  {
    "id": 176,
    "info": {
      "abbriviature": "ENG 201",
      "description": "This course provides an introduction to basic probability theory and statistics. ",
      "title": "Applied Statistics"
    }
  },
  {
    "id": 177,
    "info": {
      "abbriviature": "ESE 709",
      "description": "Climate Change\nAtmospheric chemistry\nAir emissions from transportation, power generation, and industrial sectors \nAtmospheric dispersion modeling\n",
      "title": "Air Pollution & Climate Change"
    }
  },
  {
    "id": 178,
    "info": {
      "abbriviature": "FRE 101",
      "description": "n/a",
      "title": "Beginning French I"
    }
  },
  {
    "id": 179,
    "info": {
      "abbriviature": "FRE 102",
      "description": "n/a",
      "title": "Beginning French II"
    }
  },
  {
    "id": 180,
    "info": {
      "abbriviature": "FRE 312",
      "description": "In this French advanced expression course, students fine-tune their speaking and writing skills through intensive class discussion, oral presentations, pronunciation drills, linguistic lessons, and other activities. ",
      "title": "Advanced Expression"
    }
  },
  {
    "id": 181,
    "info": {
      "abbriviature": "FRE 314",
      "description": "This course covers two main components: advanced study and practice of structures of French grammar, and the development of effective skills, focused on various writing genres.",
      "title": "Advanced French Grammar and Composition "
    }
  },
  {
    "id": 182,
    "info": {
      "abbriviature": "GER 101",
      "description": "This course is for beginners. During the course we will focus on all 4 main skills of language-learning: reading, listening, writing and speaking as well as a 5th skill: audio-visual comprehension.",
      "title": "Beginning German"
    }
  },
  {
    "id": 183,
    "info": {
      "abbriviature": "GER 102",
      "description": "Continuation of GER 101. ",
      "title": "Beginning German II"
    }
  },
  {
    "id": 184,
    "info": {
      "abbriviature": "GSBM 646",
      "description": "This course focuses on six core leadership domains (personal, relational, contextual, inspirational, supportive, and responsible leadership).",
      "title": "Advanced Leadership"
    }
  },
  {
    "id": 185,
    "info": {
      "abbriviature": "HST 103",
      "description": "n/a",
      "title": "Central Asian History I (to 1700)"
    }
  },
  {
    "id": 186,
    "info": {
      "abbriviature": "HST 104",
      "description": "n/a",
      "title": "Central Asian History II (1700 - 1991)"
    }
  },
  {
    "id": 187,
    "info": {
      "abbriviature": "HST 214",
      "description": "This course will introduce the idea of comparative history. We will compare, and contrast, the history of two regions in different parts of the world, but with some similarities as well as differences in their histories. \nWe will study the transformation of the steppes of Eurasia and Great Plains of North America between the 16th and 20th centuries. Large parts of these grasslands and the lives of their inhabitants  -- steppe nomads, such as Kazakhs, and Plains Indians, for example the Sioux -- were changed forever. Their lands were conquered and annexed by larger states: the Russian Empire, later the Soviet Union, and United States of America. \nThe Russian and American states sponsored scientific studies of these lands, encouraged outsiders to settle or colonize them, and suppressed resistance. The settlers supported themselves partly by plowing up the land and growing crops. Their agricultural way of life partly replaced that of the native peoples who had relied more heavily on herding and hunting animals. The settlers reaped large harvests in good years, when the rains came, but experienced crises in years of drought. From the late nineteenth century there were attempts to develop more sustainable ways of farming and to conserve samples of the former natural environment of the grasslands. The changing ways of life in the grasslands were reflected in the cultures of the two societies.",
      "title": "An Introduction to Comparative History:  The Eurasian Steppes and Great Plains of North America"
    }
  },
  {
    "id": 188,
    "info": {
      "abbriviature": "HST 223/ANT 287",
      "description": "A global history of human behaviour and human bodies viewed through the lens of cannibalism.",
      "title": "Cannibalism and Civilization"
    }
  },
  {
    "id": 189,
    "info": {
      "abbriviature": "HST 381/SOC 319",
      "description": "This course surveys the history of HIV/AIDS from its beginnings in the 1980s through the present. Employing a comparative perspective, it examines the biological, epidemiological, medical, social, economic, political, and cultural facets of the AIDS crisis on a global level.",
      "title": "AIDS and Society"
    }
  },
  {
    "id": 190,
    "info": {
      "abbriviature": "KAZ 1",
      "description": "n/a",
      "title": "Basic Kazakh (CPS 1)"
    }
  },
  {
    "id": 191,
    "info": {
      "abbriviature": "KAZ 101",
      "description": "n/a",
      "title": "Basic Kazakh (CPS 2)"
    }
  },
  {
    "id": 192,
    "info": {
      "abbriviature": "KAZ 101",
      "description": "n/a",
      "title": "Basic Kazakh I"
    }
  },
  {
    "id": 193,
    "info": {
      "abbriviature": "KAZ 102",
      "description": "n/a",
      "title": "Basic Kazakh 1/1"
    }
  },
  {
    "id": 194,
    "info": {
      "abbriviature": "KAZ 102",
      "description": "n/a",
      "title": "Basic Kazakh 1/2"
    }
  },
  {
    "id": 195,
    "info": {
      "abbriviature": "KAZ 103",
      "description": "n/a",
      "title": "Basic Kazakh 2/1"
    }
  },
  {
    "id": 196,
    "info": {
      "abbriviature": "KAZ 103",
      "description": "n/a",
      "title": "Basic Kazakh 2/2"
    }
  },
  {
    "id": 197,
    "info": {
      "abbriviature": "KAZ 150",
      "description": "A remedial course to prepare students for KAZ 201, Academic Kazakh I.",
      "title": "Basic Kazakh"
    }
  },
  {
    "id": 198,
    "info": {
      "abbriviature": "KAZ 201",
      "description": "The goal of the class is to lead students to function well at the B2 level. In this course will further develop the skills of listening, speaking, reading and writing in Kazakh in a range of predictable/ unpredictable situations and familiarize students with a range of new grammar structures. The class activities will focus on listening, speaking and students will be encouraged to practice reading and writing skills in their own time.",
      "title": "Academic Kazakh I"
    }
  },
  {
    "id": 199,
    "info": {
      "abbriviature": "KAZ 202",
      "description": "Students enrolled in Academic Kazakh II are expected to function at the B2 level after taking KAZ 201 Academic Kazakh. The goal of the course is to lead students to function well at the B2 level and make significant progress at the C1 level.",
      "title": "Academic Kazakh II"
    }
  },
  {
    "id": 200,
    "info": {
      "abbriviature": "KAZ 210",
      "description": "n/a",
      "title": "Academic Kazakh 2/1"
    }
  },
  {
    "id": 201,
    "info": {
      "abbriviature": "KAZ 210",
      "description": "n/a",
      "title": "Academic Kazakh 2/2"
    }
  },
  {
    "id": 202,
    "info": {
      "abbriviature": "KAZ 211",
      "description": "This course aimed to develop academic speaking and oral skills. During this course students will have opportunities to engage into interactive activities such us in-class conversations, discussions, they will  present their materials in Kazakh.",
      "title": "Academic Speaking in Kazakh"
    }
  },
  {
    "id": 203,
    "info": {
      "abbriviature": "KAZ 212",
      "description": "This course allows students to improve their academic writing in Kazakh language. The students will learn how to analyze popular scientific texts and comprehensively construct essays with academic content. ",
      "title": "Academic Writing in Kazakh"
    }
  },
  {
    "id": 204,
    "info": {
      "abbriviature": "KAZ 263",
      "description": "n/a",
      "title": "Business Etiquette"
    }
  },
  {
    "id": 205,
    "info": {
      "abbriviature": "KAZ 365",
      "description": "The purpose of the course is deepening student learning Abai’s literary legacy.",
      "title": "Abai’s World"
    }
  },
  {
    "id": 206,
    "info": {
      "abbriviature": "KOR 101",
      "description": "This course is for beginners. During the course we will focus on all 4 main skills of language-learning: reading, listening, writing and speaking.   ",
      "title": "Beginning Korean I"
    }
  },
  {
    "id": 207,
    "info": {
      "abbriviature": "MAMB 840",
      "description": "4-week  Ambulatory  Internal Medicine clerkship. The location for the Ambulatory Medicine is the Diagnostic Center, UMC and the National Referral Hospital for Oncology and Transplantation.",
      "title": "Ambulatory Internal Medicine Clerkship"
    }
  },
  {
    "id": 208,
    "info": {
      "abbriviature": "MANS 811",
      "description": "This 2-week clerkship overview covers the disciplines of general anesthesiology. The course is primarily designed to prepare students to assume the role of a primary care physician and to become familiar with the clinical presentations and management of common problems in anesthesiology. ",
      "title": "Anesthesiology Clerkship"
    }
  },
  {
    "id": 209,
    "info": {
      "abbriviature": "MATH 161",
      "description": "n/a",
      "title": "Calculus I"
    }
  },
  {
    "id": 210,
    "info": {
      "abbriviature": "MATH 162",
      "description": "n/a",
      "title": "Calculus II"
    }
  },
  {
    "id": 211,
    "info": {
      "abbriviature": "MATH 169",
      "description": "n/a",
      "title": "Accelerated Calculus"
    }
  },
  {
    "id": 212,
    "info": {
      "abbriviature": "MATH 263",
      "description": "n/a",
      "title": "Calculus III"
    }
  },
  {
    "id": 213,
    "info": {
      "abbriviature": "MATH 310",
      "description": "Descriptive statistics, measures of location and spread,graphic methods,basic probability properties, Bayes’ rule, probability distributions, expected value and variance, binomial and normal distributions,  point and interval estimation,hypothesis testing,one-sample and two-sample t-tests,chi-square tests,linear regression, quality measures, and assumption verification, ANOVA and multiple comparisons.",
      "title": "Applied Statistical Methods"
    }
  },
  {
    "id": 214,
    "info": {
      "abbriviature": "MATH 323",
      "description": "This course covers the standard topics for the Financial Mathematics (FM) exam recommended by the Society of Actuaries  (SDA)",
      "title": "Actuarial Mathematics I "
    }
  },
  {
    "id": 215,
    "info": {
      "abbriviature": "MATH 360",
      "description": "The course covers total derivatives, Taylor formula in several variables, inverse and implicit function theorems as well as applications. The main goal is to prove Stokes theorem with differential forms. ",
      "title": "Advanced Calculus with Differential Forms"
    }
  },
  {
    "id": 216,
    "info": {
      "abbriviature": "MATH 402",
      "description": "n/a",
      "title": "Abstract Algebra I"
    }
  },
  {
    "id": 217,
    "info": {
      "abbriviature": "MATH 423",
      "description": "Life insurances, survival distributions and models, life tables, life annuities, contingency models, insurance benefits, premium and reserve calculations, multiple life and multiple decrement models.",
      "title": "Actuarial Mathematics II"
    }
  },
  {
    "id": 218,
    "info": {
      "abbriviature": "MATH 477",
      "description": "Computer-aided Introduction to Finite Element Methods for solving initial/boundary value problems in science and engineering with industrial applications, implementation techniques.",
      "title": "Applied Finite Element Methods"
    }
  },
  {
    "id": 219,
    "info": {
      "abbriviature": "MATH 499",
      "description": "n/a",
      "title": "Capstone Project"
    }
  },
  {
    "id": 220,
    "info": {
      "abbriviature": "MATH 518",
      "description": "Computer-aided Finite Element Analysis for initial/boundary value problems in science and engineering with industrial applications; implementation techniques in Matlab/Octave.",
      "title": "Applied Finite Element Analysis"
    }
  },
  {
    "id": 221,
    "info": {
      "abbriviature": "MATH 551",
      "description": "This course covers advanced numerical methods that are used in large scale scientific and engineering computations and simulations. The topics include Krylov subspace methods and preconditioning, conjugate gradient method and BiCGstab, iterative methods for eigenvalue computation, and advanced numerical methods for initial value problems.",
      "title": "Advanced Numerical Methods"
    }
  },
  {
    "id": 222,
    "info": {
      "abbriviature": "MATH 676",
      "description": "Laplace and heat equations, wave equations, fundamental solutions, maximum principles, Sobolev spaces, embedding theorems, weak solutions, energy methods, regularity of solutions,  existence and uniqueness of solutions, general linear elliptic, parabolic and hyperbolic equations, and applications.",
      "title": "Advanced Partial Differential Equations with Applications"
    }
  },
  {
    "id": 223,
    "info": {
      "abbriviature": "MATH 714",
      "description": "Operations research helps in solving problems in different environments that needs decisions. This course covers topics that include: mathematical programming, stochastic optimization, fuzzy optimization, dynamic programming, deterministic and stochastic optimal control, multi-criteria decision aid, and application to engineering, finance, management.",
      "title": "Advanced Operations Research"
    }
  },
  {
    "id": 224,
    "info": {
      "abbriviature": "MATH 740",
      "description": "The course covers theoretical foundations and applications of machine learning models. Topics include supervised methods for regression and classification (linear models, trees, neural networks, ensemble methods, instance-based methods), Bayesian parametric learning, density estimation and clustering, sequential models. Programming projects covering a variety of real-world applications are assigned.",
      "title": "Advanced Statistical Learning"
    }
  },
  {
    "id": 225,
    "info": {
      "abbriviature": "MATH 776",
      "description": "The course is a blend of conceptual and practical aspects of numerical solutions of partial differential equations. Topics include finite difference, volume, and element methods, and explicit/implicit methods for time integration, convergence, consistency, stability, Courant-Friedrichs-Lewy criteria, Lax equivalence theorem, error analysis, Fourier-von Neumann stability analysis. Applications include the Poisson equation, heat equation, wave equation, advection-diffusion equation, and Stokes equation.",
      "title": "Advanced numerical methods for partial differential equations"
    }
  },
  {
    "id": 226,
    "info": {
      "abbriviature": "MBA 02",
      "description": "The course provides basic mathematics as well as computer skills required to achieve functional literacy with a basic set of business software tools.",
      "title": "Business Mathematics and Business Computer Application"
    }
  },
  {
    "id": 227,
    "info": {
      "abbriviature": "MBA 05",
      "description": "The ability to express oneself effectively is a key determinant of the impact and influence one is able to have within an organization.",
      "title": "Business Communication"
    }
  },
  {
    "id": 228,
    "info": {
      "abbriviature": "MBAE 15",
      "description": "This course was designed to develop graduate students’ ability to make financial decisions and recommendations through the application of finance theory and concepts to a wide range of business cases representative of real world problems. ",
      "title": "Advanced Corporate Finance"
    }
  },
  {
    "id": 229,
    "info": {
      "abbriviature": "MBAE 17",
      "description": "This subject is designed to provide students with an introduction to the key issues facing business in China. ",
      "title": "China Business Environment"
    }
  },
  {
    "id": 230,
    "info": {
      "abbriviature": "MBME 602",
      "description": "This course is designed to cover the basics of human anatomy and physiology including anatomical terminology, cells and tissues, body parts, the musculoskeletal system, the nervous system, special senses, the cardiovascular system, ECG, the respiratory system, and urinary system.  The course provides a foundation in human anatomy appropriate for biomedical engineering professionals.  Learning objectives will be achieved through a combination of lecture and practical (on models) approaches, reinforced by clinical examples and analysis of how biomedical devices interface with anatomical structures. ",
      "title": "Anatomy and Physiology for Biomedical Engineers"
    }
  },
  {
    "id": 231,
    "info": {
      "abbriviature": "MBME 603",
      "description": "The course “Biomaterials Science & Engineering” will present an overview of man-made and natural materials which are currently in use of different branches of medical treatment. Pros and contras of different materials will be discussed. Special emphasis will be paid on polymeric biomaterials; these are encountered in almost all medical subdisciplines such as dentistry, orthopedic surgery, vascular surgery, gynecology, oncology and ophthalmology. Special attention will be given to the concept of “biocompatibility”, including modern insights regarding wound healing and host-implant interactions on macro- and microscopic levels. ",
      "title": "Biomaterials Science & Engineering"
    }
  },
  {
    "id": 232,
    "info": {
      "abbriviature": "MBME 604",
      "description": "The Biosensors course will provide an interdisciplinary view of biosensors, focusing on the technological aspects, as well as on implementation and applications, with elements of electronics, photonics, surface chemistry, and biology. The course will present electronic biosensors, optical biosensors, biorecognition and functionalization, and applications of biosensors.",
      "title": "Biosensors"
    }
  },
  {
    "id": 233,
    "info": {
      "abbriviature": "MBME 607",
      "description": "This course is designed to cover the most recent advancements in different areas of applications of tissue engineering. The topics in this course will include tissue engineering strategies such as i) compositional, structural and functional analysis of different tissues in human body, ii) design, fabrication and utilization of scaffold biomaterials and iii) cellular engineering including cell therapy, drug delivery; as well as cell-biomaterial interactions. Recent advances and major problems relevant to tissue engineering will also be presented and discussed.",
      "title": "Advanced Tissue Engineering"
    }
  },
  {
    "id": 234,
    "info": {
      "abbriviature": "MBME 708",
      "description": "This course will introduce the physical principles and applications of in vivo bioimaging modalities including X-ray computed tomography (CT), Single-photon emission computed tomography (SPECT), positron emission tomography (PET), clinical applications of nuclear medicine, ultrasonic imaging (US), and magnetic resonance imaging (MRI).",
      "title": "Biomedical Imaging"
    }
  },
  {
    "id": 235,
    "info": {
      "abbriviature": "MBSB 610",
      "description": "This Block provides strong fundamental scientific basis of human anatomy, genetics, cell pathology and microbiology, forming the basis of Medical practice and allowing students to apply the clinical knowledge and skills.",
      "title": "Basic Science Block"
    }
  },
  {
    "id": 236,
    "info": {
      "abbriviature": "MBSB 613",
      "description": "n/a",
      "title": "Cellular Pathologic Basis of Disease"
    }
  },
  {
    "id": 237,
    "info": {
      "abbriviature": "MCE 604",
      "description": "This course is an advanced course for students who have completed Project Management.  More advanced theories and practices will be introduced in this course and students are expected to have possessed basic project management concepts.",
      "title": "Advanced Project Management"
    }
  },
  {
    "id": 238,
    "info": {
      "abbriviature": "MCE 615",
      "description": "This course aims to lay foundation for the practical applications of the Geomatics for the Civil Engineering projects, to master Remote Sensing and GIS skills and to provide students opportunity to develop projects with applications of remote Sensing and GIS for Civil Engineering.   ",
      "title": "Applications of Geomatics in Civil Engineering"
    }
  },
  {
    "id": 239,
    "info": {
      "abbriviature": "MCEE 604",
      "description": "This course is designed to provide students a theoretical framework for the analysis of deformation and failure of soils with application to several practical problems. These include elasticity for linear deformation, plasticity models (including critical state model) for non-linear deformation and limit equilibrium analyses for important geotechnical problems.",
      "title": "Advanced Soil Mechanics"
    }
  },
  {
    "id": 240,
    "info": {
      "abbriviature": "MCEE 605",
      "description": "This course will provide graduate students detailed theoretical backgrounds and their applications and computational implementations to estimate the fate of chemical species in the environmental systems.",
      "title": "Advanced Environmental Chemistry"
    }
  },
  {
    "id": 241,
    "info": {
      "abbriviature": "MCEE 606",
      "description": "The aim of this module is to\n1.\tApply knowledge and skills in the solution of Engineering Management problems\n2.\tUnderstand the importance of leadership in team development and operation. \n3.\tIdentify, formulate, and solve issues related to project implementation.",
      "title": "Advanced Project Management"
    }
  },
  {
    "id": 242,
    "info": {
      "abbriviature": "MCEE 701",
      "description": "This course provides an overview of materials used to make portland cement concrete (PCC) and mechanisms of concrete durability.  This course also identifies appropriate PCC material properties for PCC construction projects.\n\n",
      "title": "Advanced Concrete Technology"
    }
  },
  {
    "id": 243,
    "info": {
      "abbriviature": "MCEE 712",
      "description": "This course is designed to develop student’s knowledge further and enable them to plan, design, and analyze new and existing pavements.  This course addresses the theory and practice in the fundamentals of pavement design and rehabilitation strategy such as pavement performance, structural design of pavement layers, types of materials used in pavement layers, characterization of pavement layer materials.  Concepts of pavement management and pavement rehabilitation strategy will be introduced.  Pavement design and evaluation computational tools will be introduced and applied.",
      "title": "Advanced Pavement Design, Analysis, and Rehabilitation"
    }
  },
  {
    "id": 244,
    "info": {
      "abbriviature": "MCEE 713",
      "description": "The objective of this course is to prepare students for advanced-level structural engineering employment by providing them with abilities to design and analyze reinforced concrete structures. This course provides students with advanced techniques, such as section analysis, yield line theory, 2nd order analysis, and Bresler’s reciprocal theory, for analysis and design of reinforced concrete structural members under the complicate loading conditions such as torsion, bi-axial bending, and buckling.",
      "title": "Advanced Concrete Design"
    }
  },
  {
    "id": 245,
    "info": {
      "abbriviature": "MCEE 714",
      "description": "This course will provide graduate students detailed theoretical background and its applications to the design and development of advanced wastewater treatment systems.",
      "title": "Advanced Wastewater Treatment"
    }
  },
  {
    "id": 246,
    "info": {
      "abbriviature": "MCHE 614",
      "description": "This course covers advanced applied chemical engineering thermodynamics topics with focus on V-L multicomponent equilibrium. ",
      "title": "Applied Chemical Engineering Thermodynamics"
    }
  },
  {
    "id": 247,
    "info": {
      "abbriviature": "MCHE 615",
      "description": "This course is designed to provide advanced knowledge in the current theory and practice of process systems engineering with the emphasis on petrochemical, oil and gas industries.",
      "title": "Advanced Unit Operations"
    }
  },
  {
    "id": 248,
    "info": {
      "abbriviature": "MCHE 616",
      "description": "Design for Multiple Reactors and Multiple Reactions\nHeterogeneous non-Catalytic and Catalytic Reaction Systems \nIsothermal and non-Isothermal Reactors\nNon-ideal Reactors\nReactors Scale Up\nBiochemical Reactors\n",
      "title": "Advanced Chemical Reactor Engineering"
    }
  },
  {
    "id": 249,
    "info": {
      "abbriviature": "MCHME 603",
      "description": "The main technologies for the production of high-value materials from polymers and ceramics and the theory which underlies materials processing operations will be covered in this course.",
      "title": "Advanced Materials Processing"
    }
  },
  {
    "id": 250,
    "info": {
      "abbriviature": "MCHME 604",
      "description": "Fundamentals, Operation, and Applications of Electron Microscopy, Spectroscopy, Diffraction, Calorimetry, and Thermogravimetric Analysis.",
      "title": "Advanced Materials Characterization Methods"
    }
  },
  {
    "id": 251,
    "info": {
      "abbriviature": "MCHME 605",
      "description": "The course is addressed to graduate students and aims at reinforcing and enhancing the knowledge they have on chemical reaction engineering, focusing on problem solving techniques and on connecting the principles presented with relevant applications, especially in the production of materials.",
      "title": "Advanced Chemical Reaction Engineering"
    }
  },
  {
    "id": 252,
    "info": {
      "abbriviature": "MCHME 606",
      "description": "Advanced Heat and Mass Transfer focuses on the study and modeling of different types of heat and mass processes for various complex systems and apparatus in chemical engineering.",
      "title": "Advanced Heat and Mass Transfer"
    }
  },
  {
    "id": 253,
    "info": {
      "abbriviature": "MCHME 701",
      "description": "This course covers advanced applied chemical engineering thermodynamics topics with focus on V-L multicomponent equilibrium. ",
      "title": "Advanced Chemical Thermodynamics"
    }
  },
  {
    "id": 254,
    "info": {
      "abbriviature": "MCHME 704",
      "description": "This course enables students to understand dynamic risk assessment and accident modeling approach. It equips students with process safety analysis skills.\n\n",
      "title": "Advanced Safety, Reliability and Risk Engineering in Process Industries"
    }
  },
  {
    "id": 255,
    "info": {
      "abbriviature": "MCHME 712",
      "description": "This course is designed to cover the most recent advancements in different areas of applications of tissue engineering. The topics in this course will include tissue engineering strategies such as i) compositional, structural and functional analysis of different tissues in human body, ii) design, fabrication and utilization of scaffold biomaterials and iii) cellular engineering including cell therapy, drug delivery; as well as cell-biomaterial interactions. Recent advances and major problems relevant to tissue engineering will also be presented and discussed.",
      "title": "Advanced Tissue Engineering"
    }
  },
  {
    "id": 256,
    "info": {
      "abbriviature": "MCHME 713",
      "description": "This course covers the fundamentals, characterizations and preparation methods of advanced and currently used materials for energy applications. Generation, conversion and storage in solar cells, fuel cells and particularly Li-ion batteries are going to be presented. Additionally, special and unique properties of materials will be considered for designing of batteries for particular applications. Other advanced energy related technologies as fuel cell and photovoltaics will be introduced and the main applied  materials will be discussed. ",
      "title": "Advanced Energy Materials and their Applications "
    }
  },
  {
    "id": 257,
    "info": {
      "abbriviature": "MCHME 715",
      "description": "\nThis course discusses chemical and thermodynamic processes in the atmosphere resulting in the nucleation of the airborne particles. The resulting health effects on the human will be discussed. This course explains how to identify sources of pollutants indoors and outdoor, their exposure routes, emission rate of the pollutants, and approaches to reduce the emissions\n",
      "title": "Air Quality, Toxicity and Health"
    }
  },
  {
    "id": 258,
    "info": {
      "abbriviature": "MECE 603",
      "description": "Growth of functions, sorting algorithms, hash tables, red-black trees, augmenting data structures, dynamic programming, greedy algorithms, amortized analysis, B-trees, Binomial heaps, Fibonacci heaps, minimum spanning tree, shortest path algorithms, flow networks, sorting networks, linear programming, string matching, computational geometry, NP-completeness, approximation algorithms.",
      "title": "Advanced Data Structures and Algorithms "
    }
  },
  {
    "id": 259,
    "info": {
      "abbriviature": "MECE 702",
      "description": "The aim of the course is to make a student familiar with the fundamentals of modern advanced power electronics - DC-DC converters,  multilevel DC-DC and DC-AC converters - diode-clamped; flying capacitor; cascade H-bridge; modulation strategies - phase-shifted and level-shifted; analysis of natural voltage balancing dynamics; analysis of voltage and current quality for Pulse Width Modulation and synchronous low frequency switching.",
      "title": "Advanced Power Electronics"
    }
  },
  {
    "id": 260,
    "info": {
      "abbriviature": "MECE 703",
      "description": "The course Advanced Photonics aims at giving students theoretical and applied concepts of photonic engineering. The course, having strong lab content, extends over 3 main areas: (1) Optical waveguides and optical fibers; (2) Optical sensors; (3) Microscopy and imaging.",
      "title": "Advanced Photonics"
    }
  },
  {
    "id": 261,
    "info": {
      "abbriviature": "MECE 705",
      "description": "This course will provide graduate students detailed theoretical background and their applications of analog and mixed-signal integrated circuits through project based learning.",
      "title": "Advanced Mixed Signal Circuit Design"
    }
  },
  {
    "id": 262,
    "info": {
      "abbriviature": "MECE 719",
      "description": "This course presents advanced analytical techniques for formulating and solving problems in applied electromagnetics.  Topics covered are basic electromagnetic theorems, boundary conditions, solutions to the wave equation, Green's functions, spectral domain representations, electric and magnetic field integral equations, and antennas and apertures.  Applications of these methods are also presented in the areas of radiation, radiowave propagation in stratified media, scattering, electromagnetic compatibility, and metamaterials. ",
      "title": "Advanced Electromagnetics"
    }
  },
  {
    "id": 263,
    "info": {
      "abbriviature": "MEE 602",
      "description": "The aim of the course is to make a student familiar with the fundamentals of modern advanced power electronics - DC-DC converters including Switched Capacitor Converters with multiphase balanced switching; multilevel DC-DC and DC-AC converters - diode-clamped; flying capacitor; cascade H-bridge; modulation strategies - phase-shifted and level-shifted; analysis of natural voltage balancing dynamics; analysis of voltage and current quality for Pulse Width Modulation and synchronous low frequency switching.",
      "title": "Advanced Power Electronics"
    }
  },
  {
    "id": 264,
    "info": {
      "abbriviature": "MINE 503",
      "description": "This course will cover: sampling methodology. Merits of various advanced resource estimation methods variogram, estimation variance, block variance, kriging, and geostatistical simulation. Application of simulation methods in resource estimation including mining and petroleum and how to manage uncertainty in resources estimation.",
      "title": "Applied Geostatistics"
    }
  },
  {
    "id": 265,
    "info": {
      "abbriviature": "MINE 505",
      "description": "This course covers the provision of a safe underground working environment through appropriate ventilation practice. ",
      "title": "Advanced Mine Ventilation"
    }
  },
  {
    "id": 266,
    "info": {
      "abbriviature": "MINE 508",
      "description": "Analytical and numerical modeling analysis of stresses and displacements induced around engineering excavations in rock. Rock deformation and failure criteria. Measurement and monitoring techniques in rock mechanics. Principles of design of excavation in rocks. Analytical, numerical modeling and empirical design methods. Probabilistic and deterministic approaches to rock engineering designs. Excavation design examples for shafts, tunnels, large chambers and mine pillars. Seismic loading of structures in rock.",
      "title": "Advanced Rock Mechanics"
    }
  },
  {
    "id": 267,
    "info": {
      "abbriviature": "MINE 509",
      "description": "The process, technologies and methods for an optimal surface mine plan and design will be covered in this course.",
      "title": "Advanced Surface Mine Design"
    }
  },
  {
    "id": 268,
    "info": {
      "abbriviature": "MINE 510",
      "description": "Selection, design, and development of most suitable underground mining methods based upon the physical and the geological properties of mineral deposits (metallic, nonmetallic and coal), conservation considerations, and associated environmental impacts.",
      "title": "Advanced Underground Mine Design"
    }
  },
  {
    "id": 269,
    "info": {
      "abbriviature": "MINE 524",
      "description": "The course covers the principles and application of tunneling in rock masses.\n\n",
      "title": "Advanced Tunnelling"
    }
  },
  {
    "id": 270,
    "info": {
      "abbriviature": "MINE 701",
      "description": "This course provides students with a practical understanding of the application of the fundamental principles governing the behavior of geo-materials (soil, soft and hard rock) in surface and underground mining environments. It covers: firstly a review of some fundaments of geomechanics; then basic and more advanced applications of geomechanics and finally discusses the implementation of computational tools including numerical modeling, artificial intelligence and data analytics in geomechanics. ",
      "title": "Advanced Mine Geomechanics "
    }
  },
  {
    "id": 271,
    "info": {
      "abbriviature": "MINE 703",
      "description": "This course students will be able to demonstrate how thinking of mining systems in systems thinking in engineering assist them to think critically and be prepared to solve challenging problems in dealing with complex orebodies.\n\n",
      "title": "Advanced Mining Systems"
    }
  },
  {
    "id": 272,
    "info": {
      "abbriviature": "MINE 803",
      "description": "This course provides a technical knowledge for application of geometallurgy in ore characterization. Geometallurgy is an important strategy for any mining project, where the prime objective is to improve the profitability of mines through the use of spatial models of rock properties that have a significant impact on value in a mining project, because it directly influences the revenue from saleable material.",
      "title": "Advanced Geometallurgy"
    }
  },
  {
    "id": 273,
    "info": {
      "abbriviature": "MINE 806",
      "description": "The objective of this course is to introduce the advanced numerical methods used in rock engineering with application within the mining industry. Fundamentals of continuum and discontinuum mechanics will be reviewed. The application of advanced numerical methods to actual engineering will be demonstrated through case studies and modelling exercises.",
      "title": "Advanced Numerical Methods"
    }
  },
  {
    "id": 274,
    "info": {
      "abbriviature": "MMAE 604",
      "description": "N/A",
      "title": "Advanced Computational Fluid Dynamics (CFD) and Heat Transfer in Mechanical Engineering"
    }
  },
  {
    "id": 275,
    "info": {
      "abbriviature": "MMAE 605",
      "description": "This course will be covering principles and applications of advanced/ nontraditional machining and additive manufacturing processes. In addition to that, aspect of lean manufacturing and life cycle assessment will be included as well. Under this course, student will be performing, laboratory project and term paper presentation on relevant topic.",
      "title": "Advanced Manufacturing Processes & Strategies"
    }
  },
  {
    "id": 276,
    "info": {
      "abbriviature": "MMAE 700",
      "description": "This module is going to develop knowledge about advanced statistics and probability, which is very important for experimental research and results analysis. It will cover statistical methods and probability of events as well as planning of experiments",
      "title": "Advanced Statistics and Probability"
    }
  },
  {
    "id": 277,
    "info": {
      "abbriviature": "MMAE 703",
      "description": "The module is delivered in a project-based format, involving case studies from machine design, space satellite design, aeronautical structures, wind turbines, ground vehicles etc, in the context of running design and research projects with industrial partners. The course makes use of a dedicated Concurrent Engineering Design environment (Machine Design Laboratory), training students in state-of-the-art workflows (CAD/ CAE/ PDM).",
      "title": "Advanced Engineering Design and Manufacturing"
    }
  },
  {
    "id": 278,
    "info": {
      "abbriviature": "MME 606",
      "description": "This course introduces the theories, techniques and computational tools in advanced control systems.",
      "title": "Advanced Control Systems"
    }
  },
  {
    "id": 279,
    "info": {
      "abbriviature": "MME 622",
      "description": "The module explores the couplings between design, manufacturing, operation/ performance, maintenance and end-of-life and equips students with core knowledge regarding the physical principles involved, constitutive models and applicable architectures and design methods.",
      "title": "Advanced Design and Manufacturing"
    }
  },
  {
    "id": 280,
    "info": {
      "abbriviature": "MME 625",
      "description": "This course aims at bringing the MSc students, who arrive with quite varying backgrounds in Computer Aided Engineering (CAE), up to the same advanced level.",
      "title": "Advanced Computer Aided Engineering"
    }
  },
  {
    "id": 281,
    "info": {
      "abbriviature": "MME 626",
      "description": "This course will be covering principles and applications of advanced/ nontraditional machining and additive manufacturing processes. In addition to that, aspect of lean manufacturing and life cycle assessment will be included as well. Under this course, student will be performing, laboratory project and term paper presentation on relevant topic. ",
      "title": "Advanced Manufacturing Processes and Strategies"
    }
  },
  {
    "id": 282,
    "info": {
      "abbriviature": "MMMM 503",
      "description": "Bioethics in Research will highlight the importance of bioethics knowledge for a successful career in science and will increase awareness of the risks related to scientific misconduct and conflict of interests.",
      "title": "Bioethics in Research: Principles and Practice"
    }
  },
  {
    "id": 283,
    "info": {
      "abbriviature": "MMMM 506",
      "description": "Biocomputing is an interdisciplinary field focusing on study, design, and implementation of information systems that allow students to perform in silico biomedical research. Students will acquire essential skills through hands-on coursework, essential for the development of the basic knowledge necessary to interrogate in silico systems.",
      "title": "Biocomputing"
    }
  },
  {
    "id": 284,
    "info": {
      "abbriviature": "MMMM 607",
      "description": "This course provides for theoretical and applied aspects of precision medicine, which include genomics, genetics and epigenetics of disease, and bioinformatics. It also discusses applications of precision medicine in disease diagnosis and management, and analysis of big data. The legal and ethical issues relating to precision medicine and genomics will also be discussed.\n\n",
      "title": "Basics and Applied Precision Medicine"
    }
  },
  {
    "id": 285,
    "info": {
      "abbriviature": "MOSP 743",
      "description": "n/a",
      "title": "Cardiovascular system"
    }
  },
  {
    "id": 286,
    "info": {
      "abbriviature": "MPA 607",
      "description": "Upon completion of this module, students will have a good understanding of the roles and responsibilities related to governments’ financial accountability and the tools used, as well as market failures, population ageing, inequality, budgeting and revenue administration.",
      "title": "Accountability, Financial and Performance Management"
    }
  },
  {
    "id": 287,
    "info": {
      "abbriviature": "MPA 611",
      "description": "Benefit cost analysis uses economic knowledge in a practical way, applying economic theory and processes to real-life problems.  The intent of this module is to equip the student with analytical, economic theory and supporting processes which can be used when facing government policy decisions in order to provide decision makers direction on what should be done.  ",
      "title": "Benefit Cost Analysis"
    }
  },
  {
    "id": 288,
    "info": {
      "abbriviature": "MPCB 602",
      "description": null,
      "title": "Basics of Medical Interviewing"
    }
  },
  {
    "id": 289,
    "info": {
      "abbriviature": "MPCB 603",
      "description": null,
      "title": "Basics of Physical Examination"
    }
  },
  {
    "id": 290,
    "info": {
      "abbriviature": "MPCB 604",
      "description": "n/a",
      "title": "Advanced Physical Examination I"
    }
  },
  {
    "id": 291,
    "info": {
      "abbriviature": "MPCB 701",
      "description": null,
      "title": "Advanced Physical Examination II"
    }
  },
  {
    "id": 292,
    "info": {
      "abbriviature": "MPCB 703",
      "description": null,
      "title": "Advanced Medical Interviewing"
    }
  },
  {
    "id": 293,
    "info": {
      "abbriviature": "MPP 625",
      "description": "The course aims to analyze key developments in political, economic, and security dimensions in each of the five nations through the prism of a holistic perspective on Central Asia as a single and distinct world region.",
      "title": "Central Asian politics: Comparative Analysis"
    }
  },
  {
    "id": 294,
    "info": {
      "abbriviature": "MPP 633",
      "description": null,
      "title": "(Inter) National Security and Public Policy"
    }
  },
  {
    "id": 295,
    "info": {
      "abbriviature": "MPP 663",
      "description": "Public economics examines government tax and spending policies: what does government do, what are the effects of these actions, and are these effects ‘good’ or ‘bad.’ This course applies economic theory to analysis of public policy using the microeconomic model of consumer behavior and studies empirical examples to evaluate theory, focusing on the casual effects of policy interventions on economic outcomes.",
      "title": "Applied Public Economics and Finance"
    }
  },
  {
    "id": 296,
    "info": {
      "abbriviature": "MPP 670",
      "description": "This course presents and discusses behavioral regularities that are of potential importance for public policy.",
      "title": "Behavioral Economics and Public Policy"
    }
  },
  {
    "id": 297,
    "info": {
      "abbriviature": "MPPS 632",
      "description": "The BEHAVIORAL MEDICINE course is oriented on some special skills of the modern doctor that has to face psychological topics like motivational interview, dealing with addicted patients and embracing the important role of health promoter. ",
      "title": "Behavioral Medicine"
    }
  },
  {
    "id": 298,
    "info": {
      "abbriviature": "MSC 602",
      "description": "This course reviews and deepens the advanced analytical and numerical methods to solve ODEs and PDEs. The whole course, lectures, and tutorials will be delivered through a mathematical software package capable to perform symbolical calculations.\nThe module is designed for graduate students to cover their research needs concerning mathematical modeling via analytical, semi-analytical or numerical techniques.\n",
      "title": "Advanced Applied Mathematics"
    }
  },
  {
    "id": 299,
    "info": {
      "abbriviature": "MSC 615",
      "description": "This module covers applied statistical methods and probability for master students.",
      "title": "Advanced Statistics and Probability"
    }
  },
  {
    "id": 300,
    "info": {
      "abbriviature": "MSF 03",
      "description": "This is the second econometrics course in the Econometrics sequence of the MSF Program at NU. The course prepares students to conduct empirical work in finance and economics.  ",
      "title": "Advanced Econometrics"
    }
  },
  {
    "id": 301,
    "info": {
      "abbriviature": "MSRB 712",
      "description": "n/a",
      "title": "Applied Evidence-based Medicine"
    }
  },
  {
    "id": 302,
    "info": {
      "abbriviature": "NUR 101",
      "description": "This course is designed to present students with a basic foundation in normal human anatomy and physiology. Topics covered are: cell physiology, histology, integumentary, skeletal, muscular, nervous and sensory systems. Emphasis is on the interaction of structure and function and the mechanisms which maintain homeostasis in the human body.\nThe laboratory component is designed to provide students with hands-on experience related to the anatomy and physiology of the human body using preserved specimens, anatomic models and interactive 3D Anatomage Table technology (computer models of muscular, neural, bone, and organ systems).  This complements the didactic component of NUR 101, with the same emphasis on structure and how it relates to function and the maintenance of homeostasis in the entire body.\n",
      "title": " Human Anatomy and Physiology 1 and Lab"
    }
  },
  {
    "id": 303,
    "info": {
      "abbriviature": "NUR 112",
      "description": "This course provides a broad overview and synthesis of the issues and trends most relevant to the practice of professional nursing. Historical, contemporary and potential influences on professional nursing practice are reviewed. An emphasis on the unique and varied roles of nurses in today's interdisciplinary health care environment are examined within the context of individual, family, community, and global health. Characteristics and major changes in health care delivery systems (local and national) are discussed. Components of professional nursing values and core practice competencies are presented. The concept of an evidence-based approach to clinical practice is introduced. The nursing process is introduced and critical thinking strategies are outlined in the context of the nursing process.  ",
      "title": " Introduction to Professional Nursing"
    }
  },
  {
    "id": 304,
    "info": {
      "abbriviature": "PER 101",
      "description": "The course is designed for those who have little or no prior knowledge of the Persian language and, therefore, aims to introduce students to the basic grammar, vocabulary, and fundamental structures of written and oral Persian. ",
      "title": "Beginning Persian I "
    }
  },
  {
    "id": 305,
    "info": {
      "abbriviature": "PETE 504",
      "description": "The main aim of this course is to review of conventional and contemporary well logging and core analysis methods and technologies. These techniques will be used to determine reservoir parameters. Also by these methods, it is possible to integrate the log, core and other well data to produce a consistent interpretation of a given reservoir. ",
      "title": "Advanced Formation Evaluation"
    }
  },
  {
    "id": 306,
    "info": {
      "abbriviature": "PETE 505",
      "description": "The main idea in this course is to present conventional technologies in drilling engineering, and main parameters to be considered in design such as drilling fluid properties, and pressure control. Also, methods will be analyzed to optimize the drilling operation for a specific reservoir. ",
      "title": "Advanced Drilling Engineering"
    }
  },
  {
    "id": 307,
    "info": {
      "abbriviature": "PETE 511",
      "description": "Well testing methods are used to estimate parameters of reservoirs such as permeability, skin factor, and drainage area. Different methods of well testing for oil and gas reservoirs are discussed and analyzed in this course. Hence, students will be able to design a well test operation and analyze data obtained from tests to improve the knowledge from hydrocarbon formations. ",
      "title": "Advanced Well Testing and Evaluation"
    }
  },
  {
    "id": 308,
    "info": {
      "abbriviature": "PETE 610",
      "description": "This course covers different aspects of Geomechanics in petroleum engineering and the application of Geomechanics in different disciplines such as drilling, formation stability, fracturing, reservoir compaction, and underground storage. \n\n",
      "title": "Advanced Reservoir Geomechanics"
    }
  },
  {
    "id": 309,
    "info": {
      "abbriviature": "PETE 703",
      "description": "This course covers different aspects of primary and secondary recovery in reservoir engineering. Also advanced topics such as fractured reservoirs will be covered for PhD students. Individual project will be offered to each PhD student during the semester. \n\n",
      "title": "Advanced Reservoir Engineering"
    }
  },
  {
    "id": 310,
    "info": {
      "abbriviature": "PETE 801",
      "description": "Different aspects and methods of discretization of fluid flow in porous media equations and methods to solve them will be discussed in this course. Simulation of reservoirs by black oil and compositional approached will be analyzed and procedure and steps of methods are discussed during the course. Specific simulation project will be assigned to PhD students in this course to develop advanced codes.\n\n",
      "title": "Advanced Reservoir Simulation "
    }
  },
  {
    "id": 311,
    "info": {
      "abbriviature": "PETE 803",
      "description": "Enhanced oil recovery course focuses on different methods used in oil industry to improve and increase the production of oil from reservoirs. Different oil recovery mechanisms are discussed in this course to describe parameters affecting sweep efficiency in porous media. Specific design and modeling projects and assignments will be designed and delivered to PhD students during the course.",
      "title": "Advanced Enhanced Oil Recovery "
    }
  },
  {
    "id": 312,
    "info": {
      "abbriviature": "PHIL 215",
      "description": "This course examines ethical challenges that arise from the possible applications of science and technology to living organisms, while drawing mainly on Marianne Talbot's Bioethics: An Introduction.",
      "title": "Bioethics"
    }
  },
  {
    "id": 313,
    "info": {
      "abbriviature": "PHIL 241",
      "description": " A paradox is an argument that leads by apparently impeccable reasoning from premises that appear to be indisputably true to a conclusion that seems patently false. Solving a paradox therefore involves rejecting something that seems commonsensically indisputable (one of the premises, the reasoning or the denial of the conclusion).  That rejection can teach us something surprising and valuable about the topic of the paradoxical argument. \n\nParadoxes covered may include Moore’s paradox (theory of knowledge and philosophy of language), the surprise exam paradox (theory of knowledge), the two-envelope paradox (decision theory) , the Cable Guy paradox (decision theory), the preface paradox (theory of knowledge), the lottery paradox (theory of knowledge and philosophy of probability) , the paradox of confirmation (philosophy of science), the Ship of Theseus (metaphysics), Thompson’s lamp (philosophy of physics), Achilles and the Tortoise (metaphysics), Newcombe’s choices (decision theory), the paradox of omnipotence (philosophy of religion), and the paradox of fiction (philosophy of literature).   \n\n",
      "title": "Beyond Common Sense: An Introduction to Paradox"
    }
  },
  {
    "id": 314,
    "info": {
      "abbriviature": "PHIL 265/REL 265",
      "description": "Daoist sages were said to merge with the changes of the cosmos. Ideally, they would be able to live without the friction of misfortune. Can we apply their principles to life today? How can we understand the world from the perspective of a sage?",
      "title": "Becoming a Sage: Introduction to Daoism"
    }
  },
  {
    "id": 315,
    "info": {
      "abbriviature": "PHYS 105",
      "description": "n/a",
      "title": "Careers in Physics"
    }
  },
  {
    "id": 316,
    "info": {
      "abbriviature": "PHYS 271",
      "description": "In this course basic methods developed for numerical solutions of math physics problems are used for solutions of real-life applications. First part of the course teaches the methods such as graphing, finding roots, numerical interpolation, extrapolation, numerical differentiation and integration, numerical diagonalization of matrices and others.",
      "title": "Applied Methods of Computational Physics with Laboratory"
    }
  },
  {
    "id": 317,
    "info": {
      "abbriviature": "PHYS 411",
      "description": "In this course students advance in problem analysis involving partial differential equations, tensors, complex-valued functions and Fourier transforms.",
      "title": "Advanced Mathematical Physics"
    }
  },
  {
    "id": 318,
    "info": {
      "abbriviature": "PHYS 463",
      "description": "The course on star formation and evolution, supernovae, general relativety, including cosmology and black holes and high energy phenomena",
      "title": "Astrophysics and General Relativity "
    }
  },
  {
    "id": 319,
    "info": {
      "abbriviature": "PHYS 465",
      "description": "n/a",
      "title": "Advanced Experimental Physics"
    }
  },
  {
    "id": 320,
    "info": {
      "abbriviature": "PHYS 545",
      "description": "This is an advanced laboratory course. Students will master assembling and designing experiments",
      "title": "Advanced Instrumentation Methods"
    }
  },
  {
    "id": 321,
    "info": {
      "abbriviature": "PHYS 550",
      "description": "This course covers advanced mathematical methods and approaches at the graduate level of study",
      "title": "Advanced Mathematical Physics"
    }
  },
  {
    "id": 322,
    "info": {
      "abbriviature": "PHYS 750",
      "description": "This is an advanced mathematical physics with the emphasis on presenting mathematical techniques that have been proven to be useful in analyzing problems in physics.\n\n",
      "title": "Advanced Mathematical Physics"
    }
  },
  {
    "id": 323,
    "info": {
      "abbriviature": "PLS 295",
      "description": "This course looks into the past conflicts in Asia and contemplates how the past affects the present and the future. Building upon philosophical discourses on forgiveness and apologies, we will try to explain how and why Asian states differently deal with their past atrocities and memories. Specifically, we will look into cases like comfort women, the Vietnam War, history textbook issues, and the North-South Korea confrontation.",
      "title": "Asian Community"
    }
  },
  {
    "id": 324,
    "info": {
      "abbriviature": "PLS 325",
      "description": "n/a",
      "title": "Ancient Political Theory"
    }
  },
  {
    "id": 325,
    "info": {
      "abbriviature": "PLS 329",
      "description": "n/a",
      "title": "Anarchy"
    }
  },
  {
    "id": 326,
    "info": {
      "abbriviature": "PLS 441",
      "description": "This course allows students to take topical courses from professors who are teaching courses on their primary areas of interest. These seminars are meant to broaden student understanding of particular issue areas in comparative politics. Potential topics include immigration, nationalism, federalism, voting, party behavior, regional studies, institutions, judicial politics, interest groups, and more.  This course draws on the research expertise of professors in the department and gives students the opportunity to read, discuss, and write about core subject areas in greater depth in preparation for their thesis work.  ",
      "title": "Advanced Topics in Comparative Politics"
    }
  },
  {
    "id": 327,
    "info": {
      "abbriviature": "PLS 451",
      "description": "This course is meant to broaden student understanding of particular issue areas in international politics.",
      "title": "Advanced Topics in International Relations"
    }
  },
  {
    "id": 328,
    "info": {
      "abbriviature": "PLS 499",
      "description": "n/a",
      "title": "Capstone Course in International Relations"
    }
  },
  {
    "id": 329,
    "info": {
      "abbriviature": "PLS 499D",
      "description": "n/a",
      "title": "Capstone Course in Comparative Politics"
    }
  },
  {
    "id": 330,
    "info": {
      "abbriviature": "PLS 510",
      "description": "This course is designed for students who already have training in research design and basic statistics.",
      "title": "Advanced Research II"
    }
  },
  {
    "id": 331,
    "info": {
      "abbriviature": "PLS 511",
      "description": "This course is an introductory course to regression analysis.",
      "title": "Advanced Research I"
    }
  },
  {
    "id": 332,
    "info": {
      "abbriviature": "PLS 541",
      "description": "This course is meant to broaden student understanding of particular issue areas in comparative politics.",
      "title": "Advanced Topics in Comparative Politics"
    }
  },
  {
    "id": 333,
    "info": {
      "abbriviature": "PLS 551",
      "description": "This course is meant to broaden student understanding of particular issue areas in international politics.",
      "title": "Advanced Topics in International Relations"
    }
  },
  {
    "id": 334,
    "info": {
      "abbriviature": "PUBH 512",
      "description": "This course builds on the concepts and applications of modern concepts in biostatistics covered in the inferential statistics course, as applied to a broad range of problems in the multidisciplinary field of public health.  The course introduces practical concepts and applications for simple and multivariate regression modeling using various link functions and sampling scheme development, sample size calculations and power analysis. The course provides opportunities for real life case applications.  Evaluation is based on individual and group problem sets (including computer quizzes, and examinations.",
      "title": "Biostatistical Modeling and Sampling"
    }
  },
  {
    "id": 335,
    "info": {
      "abbriviature": "PUBH 522",
      "description": "This course builds upon the courses Principles of Analytical Epidemiology, Social and Behavioral Sciences and both Biostatistics courses. Students learn advanced methods to further assessing the impact of bias, confounding and interaction and acquire advanced techniques for mitigating those effects.  ",
      "title": "Advanced Analytical Epidemiology"
    }
  },
  {
    "id": 336,
    "info": {
      "abbriviature": "PUBH 652",
      "description": "The course provides insight in the various research questions, designs, and analytical methods used in Health Services Research, as well as how to use them as an input into health policy making, emphasizing the necessary links between the production of scientific knowledge and the complexities of the decision making arena. HSR addresses issues such as access and quality of health care delivery, financing and use of health care services, disparities in access, the overall functioning and performance of health care systems, and implementation of change.\nThe overall goal of the course are for students to be able to competently work providing scientific support into the health policy decision making, identifying the effective and efficient ways to organize, manage, finance, and deliver high quality care, and to be able to support and stimulate policy changes to strengthen health care systems based on the best available evidence.\nThe course is organized around lectures, to set out key ideas, followed by student presentations, and some form of group exercise- this might take the form of brainstorming and group discussion. Students will give 2-3 presentations to the class on the assigned readings. They will also give 1 presentation to class on a health services and policy topic which have significant relevance for Kazakhstan.\nStudents will also be asked to work in groups to identify a policy relevant question, outline a research strategy to address this problem with a scientific rigorous methodology, and make a brief presentation to a mock funding panel in the last session.\n\n",
      "title": "Applied Methods in Health Services Research"
    }
  },
  {
    "id": 337,
    "info": {
      "abbriviature": "REL 212",
      "description": "This course offers a survey of Buddhism from its origins to the present.",
      "title": "Buddhist Religious Traditions"
    }
  },
  {
    "id": 338,
    "info": {
      "abbriviature": "REL 213",
      "description": "n/a",
      "title": "Chinese Religious Traditions"
    }
  },
  {
    "id": 339,
    "info": {
      "abbriviature": "REL 240",
      "description": "n/a",
      "title": "Christian Religious Traditions"
    }
  },
  {
    "id": 340,
    "info": {
      "abbriviature": "REL 410",
      "description": "This course will explore the diffusion and evolution of Buddhism within Central Asia and along the Silk Road.",
      "title": "Buddhism in Central Asia"
    }
  },
  {
    "id": 341,
    "info": {
      "abbriviature": "REL 510",
      "description": "n/a",
      "title": "Buddhism in Central Asia"
    }
  },
  {
    "id": 342,
    "info": {
      "abbriviature": "RFL 103",
      "description": "This course is for students with very little or no previous classroom instruction in Russian. Proficiency-based approach will stress the development of communicative abilities in- and outside the classroom.",
      "title": "Beginning Russian"
    }
  },
  {
    "id": 343,
    "info": {
      "abbriviature": "RFL 104",
      "description": "Intensive Elementary Russian II class for students who have been studying Russian for one semester.",
      "title": "Beginning Russian II"
    }
  },
  {
    "id": 344,
    "info": {
      "abbriviature": "RFL 303",
      "description": "Entering with intermediate mid or intermediate high level of Russian proficiency, students will work on increasing their level to intermediate high and advanced low or mid.",
      "title": "Advanced Russian"
    }
  },
  {
    "id": 345,
    "info": {
      "abbriviature": "RFL 304",
      "description": "Intensive Advanced Russian II class for students who have been studying Russian for five semesters. \n\n",
      "title": "Advanced Russian II"
    }
  },
  {
    "id": 346,
    "info": {
      "abbriviature": "RFL 403",
      "description": "This course is intended for students who have already achieved advanced proficiency in Russian.",
      "title": "Advanced and Superior Composition and Conversation Russian"
    }
  },
  {
    "id": 347,
    "info": {
      "abbriviature": "RFL 404",
      "description": "Intensive Advanced and Superior Composition and Conversation Russian II, equivalent to eighth-semester Russian",
      "title": "Advanced and Superior Composition and Conversation Russian II"
    }
  },
  {
    "id": 348,
    "info": {
      "abbriviature": "ROBT 613",
      "description": "This course is an introduction to the fundamentals in BMI technology and discusses its applications including both invasive and non-invasive BMI systems for controlling user interfaces, prosthetic arms, wheelchairs, and robotic exoskeletons.  ",
      "title": "Brain-Machine Interfaces "
    }
  },
  {
    "id": 349,
    "info": {
      "abbriviature": "ROBT 701",
      "description": "This course covers classical and advanced topics in robotics with particular emphasis on the dynamics and control of serial and parallel manipulators.\n\n",
      "title": "Advanced Robot Manipulation and Mobility"
    }
  },
  {
    "id": 350,
    "info": {
      "abbriviature": "ROBT 703",
      "description": "This course aims to provide the state-of-the-art concepts relative to optimal control, in particular with application to robot motion planning.\n\n",
      "title": "Advanced Optimal Control and Planning"
    }
  },
  {
    "id": 351,
    "info": {
      "abbriviature": "ROBT 709",
      "description": "The course aims to introduce the doctoral students to the state-of-the-art analytical tools and methods used for control system design.  The course will start with the modeling of physical systems in the frequency and state space domains. The student will master analytical tools such as Bode plots, root locus diagrams and phase plots. The second part of the course include frequency domain based control design (mainly focused on PID controllers) and then covers control system design in state space (linear quadratic regulators, servo-controllers, etc.). In the last part, students will glimpse to different advanced control algorithms such as model predictive control, adaptive control and soft-computing based control. The students will read and analyze advanced literature on the topic regularly.",
      "title": "Advanced Robot Dynamics and Control "
    }
  },
  {
    "id": 352,
    "info": {
      "abbriviature": "SHSS 250",
      "description": "This course builds upon the research skills, rhetorical concepts, and thesis-driven writing introduced in SHSS 150, with an aim toward situating writing within the social sciences and humanities. Students will critically read and practice writing in various genres they are likely to encounter in the social sciences and humanities. Students will analyze and discuss genres and rhetorical strategies within and across disciplines. Through a process of planning, drafting, and revision, students will develop their writing voice and produce rhetorically aware texts that are appropriate to their field including essays, a literature review, and a research paper. This course satisfies the Core Curriculum Year 2 Writing & Communication requirement. ",
      "title": "Advanced Rhetoric and Composition"
    }
  },
  {
    "id": 353,
    "info": {
      "abbriviature": "SHSS 360/WLL 360",
      "description": "This seminar is an advanced creative writing workshop-based course that focuses on the creation, research and revision of original student poetry as well as on the critical analysis of contemporary poetic theory and influential contemporary poets.",
      "title": " Poetry Writing Seminar"
    }
  },
  {
    "id": 354,
    "info": {
      "abbriviature": "SOC 321",
      "description": "This course will provide an offer an overview of perspectives on the policy making process and supply students with practical tools and methods that can be used to undertake the analysis of policy.",
      "title": "Applied Policy Analysis: Tools and Perspectives "
    }
  },
  {
    "id": 355,
    "info": {
      "abbriviature": "SOC 498",
      "description": "SOC 498 is the first part of the year-long capstone seminar taught to senior students majoring in Sociology. During this course students will design their research projects, develop research instruments, review relevant literature, obtain ethics review approval from the SHSS ethics review committee, and start data collection. There will be two types of capstone projects: Track One: An independent academic research and undergraduate thesis. Track Two: Community-engagement participatory research project and project report.",
      "title": "Capstone Seminar Part I"
    }
  },
  {
    "id": 356,
    "info": {
      "abbriviature": "SOC 499",
      "description": "SOC 499 is the second part of the year-long capstone seminar taught to senior students majoring in Sociology. The goal of this course is to help students consolidate your analytical, writing, communication, and presentation skills as well as learn new practical skills that allow students to communicate their work to both academic and nonacademic audiences.  Students will engage in systematically analyzing data, writing their findings, and revising their work through feedback and comments with the guidance of the teaching faculty member, peers, research advisor, and other experts brought into assist in the process of constructing an original product.  ",
      "title": "Capstone Seminar II"
    }
  },
  {
    "id": 357,
    "info": {
      "abbriviature": "SPA 101",
      "description": "n/a",
      "title": "Beginning Spanish I"
    }
  },
  {
    "id": 358,
    "info": {
      "abbriviature": "SPA 102",
      "description": "n/a",
      "title": "Beginning Spanish II"
    }
  },
  {
    "id": 359,
    "info": {
      "abbriviature": "SPA 314",
      "description": "The main objective of this course is to review and strengthen some of the major concepts of Spanish grammar and likewise to develop effectivewriting skills in Spanish, primarily for academic writing.",
      "title": "Advanced Spanish Grammar and Composition"
    }
  },
  {
    "id": 360,
    "info": {
      "abbriviature": "T- 17191",
      "description": "n/a",
      "title": "Artists, Patrons and Academies in Early Modern Europe "
    }
  },
  {
    "id": 361,
    "info": {
      "abbriviature": "T-1C 90031",
      "description": "N/A",
      "title": "Career Design I"
    }
  },
  {
    "id": 362,
    "info": {
      "abbriviature": "T-BNTE 509",
      "description": "N/A",
      "title": "Biotechnology"
    }
  },
  {
    "id": 363,
    "info": {
      "abbriviature": "T-CEE 498",
      "description": "N/A",
      "title": "Case Histories in Infrastructure Engineering"
    }
  },
  {
    "id": 364,
    "info": {
      "abbriviature": "T-EG 23131",
      "description": "N/A",
      "title": "Biotechnology Literacy"
    }
  },
  {
    "id": 365,
    "info": {
      "abbriviature": "T-EG 32131",
      "description": "N/A",
      "title": "Chemical Ecology"
    }
  },
  {
    "id": 366,
    "info": {
      "abbriviature": "T-FIL 1000",
      "description": "N/A",
      "title": "Cinema Survey"
    }
  },
  {
    "id": 367,
    "info": {
      "abbriviature": "T-GOV 382",
      "description": "N/A",
      "title": "American Political Concepts"
    }
  },
  {
    "id": 368,
    "info": {
      "abbriviature": "T-MAE 376",
      "description": "N/A",
      "title": "Applied Math for MAEs"
    }
  },
  {
    "id": 369,
    "info": {
      "abbriviature": "T-PP 5203",
      "description": "N/A",
      "title": "Behavioral Economics and Public Policy"
    }
  },
  {
    "id": 370,
    "info": {
      "abbriviature": "T-PP 5215",
      "description": "N/A",
      "title": "Changes in Singapore Political Economy"
    }
  },
  {
    "id": 371,
    "info": {
      "abbriviature": "T-PPA 2008",
      "description": "N/A",
      "title": "American Government and Public Administration"
    }
  },
  {
    "id": 372,
    "info": {
      "abbriviature": "T-SPI 17",
      "description": "N/A",
      "title": "Basics of Signal Processing and Imaging Methods"
    }
  },
  {
    "id": 373,
    "info": {
      "abbriviature": "T-STAT 327",
      "description": "N/A",
      "title": "Advanced Data Analysis with R"
    }
  },
  {
    "id": 374,
    "info": {
      "abbriviature": "TUR 411",
      "description": "The course is an introduction to Turkish literature through advanced readings in Turkish.",
      "title": "Advanced Readings in Turkish Literature"
    }
  },
  {
    "id": 375,
    "info": {
      "abbriviature": "TUR 412",
      "description": "Students will be introduced to the key problems of women and question of national identity in contemporary Turkey.  They will explore scholarly articles as well as newspapers, documentaries, shows and films produced recently in Turkey.   The course will be conducted in Turkish.",
      "title": "Advanced Turkish in Media and Politics"
    }
  },
  {
    "id": 376,
    "info": {
      "abbriviature": "TUR 575",
      "description": "This course will be taught on a unique topic (i.e. not taught regularly) related to Turkic Studies. Students will complete a substantial project suitable international publication. This course can also be taught by visiting faculty. May be repeated for credit.",
      "title": "Advanced Topics in Turkic Studies"
    }
  },
  {
    "id": 377,
    "info": {
      "abbriviature": "WLL 220",
      "description": "n/a",
      "title": "Ancient World Literature (to 1650)"
    }
  },
  {
    "id": 378,
    "info": {
      "abbriviature": "WLL 222",
      "description": "Acting theory and practice as explored through seminal texts in Western Realism, and reactions against Realism, as well as other acting and performance traditions in the world. Theorists and authors studied include Stanislavsky, Meyerhold, Chekhov, Vakhtangov, Artaud, Brecht, Grotowski, Suzuki and others.",
      "title": "Acting: Praxis, Theory and History"
    }
  },
  {
    "id": 379,
    "info": {
      "abbriviature": "WLL 401",
      "description": "This course broadens student understanding of particular areas in world literature. These areas may focus on geographical areas, time periods, language families, and/or theoretical topics related to the study of comparative literature. ",
      "title": "Advanced Topics in World Literature"
    }
  },
  {
    "id": 380,
    "info": {
      "abbriviature": "ZCOM 040",
      "description": "This is the first half of a two-semester communications course which provides students with a structured opportunity to develop the linguistic knowledge and academic skills and strategies necessary to achieve their academic potential at graduate study in an English-medium higher education context. The aim of the course is to help students become competent oral users of English as well as critical learners. ",
      "title": "Academic Communications for Graduate Studies I"
    }
  },
  {
    "id": 381,
    "info": {
      "abbriviature": "ZCOM 041",
      "description": "This is the second half of a two-semester communications course which provides students with a structured opportunity to develop the linguistic knowledge and academic skills and strategies necessary to achieve their academic potential at graduate study in an English-medium higher education context. The aim of the course is to help students become competent oral users of English as well as critical learners. ",
      "title": "Academic Communications for Graduate Studies II"
    }
  },
  {
    "id": 382,
    "info": {
      "abbriviature": "ZRDG 030",
      "description": "This is the first half of a two-semester reading course which provides students with a structured opportunity to examine text structures assisting them to read effectively and critically and to focus on the language, thinking, and organization of English academic writing. ",
      "title": "Academic Reading for Graduate Studies I"
    }
  },
  {
    "id": 383,
    "info": {
      "abbriviature": "ZRDG 031",
      "description": "This this the second half of a two-semester reading course which provides students with a structured opportunity to examine text structures assisting them to read effectively and critically and to focus on the language, thinking, and organization of English academic writing. ",
      "title": "Academic Reading for Graduate Studies II"
    }
  },
  {
    "id": 384,
    "info": {
      "abbriviature": "ZWRT 020",
      "description": "This is the first half of a two-semester writing course which provides students with a structured opportunity to develop the linguistic knowledge and academic skills and strategies necessary to achieve their academic potential at graduate study in an English-medium higher education context.  The aim of the course is to help students become competent users of English as well as critical learners.  ",
      "title": "Academic Writing for Graduate Studies I"
    }
  },
  {
    "id": 385,
    "info": {
      "abbriviature": "ZWRT 021",
      "description": "This is the second half of a two-semester writing course which provides students with a structured opportunity to develop the linguistic knowledge and academic skills and strategies necessary to achieve their academic potential at graduate study in an English-medium higher education context.  The aim of the course is to help students become competent writers as well as critical learners.  ",
      "title": "Academic Writing for Graduate Studies II"
    }
  }
]
